{"url": "/forums/en/wow/topic/20752430435", "title": "HEY BLIZZARD, NO ONE LIKES ABILITY PRUNING", "replies": "2", "first_post": "YOU GUYS ARE WRONG FOR IT! PERIOD. THIS GAME USED TO BE GLORIOUS AND YOU DESTROYED WHAT EVERYONE LOVED MOST! I HAVE PLAYED MAX LEVEL EVERY CLASS AND SPEC SINCE CATA AND YOU HAVE LITERALLY RUINED EVERY SINGLE SPEC AND CLASS. ITS UNREAL. NO ONE AGREES WITH WHAT YOU ARE DOING, ABILITY PRUNING HAS FAILED AS OBJECTIVELY AS THE WAR ON DRUGS, STOP COPYING MOBAS BECAUSE YOU CANT GRASP WHY YOUR GAME IS FAILING, CLASS DESIGN, UNIQUE ABILITIES, CLASS FANTASY, CLASS UTILITY, THE CORE OF YOUR GAMES SUCCESS HAS BEEN UTTERLY GUTTED. WHAT ARE YOU GOING TO DO WHEN LEGION HYPE WEARS OFF? WE ALL KNOW THIS WAS THE KEY EXPANSION FOR YOUR GAMES SUCCESS! UNSUBBED AND IT NEVER FELT SO GOOD! YOUR THREE CHOICE TALENT SYSTEM IS A JOKE. EVERYONE LIKED THE OLD TALENT SYSTEM FROM BC/WOTLK BETTER, YOUR REASONS FOR CHANGING IT WERE FALSE AND IDEALIZED BS! HERE IS THE RIGHT IDEA: GIVE EACH CLASS MORE ABILITIES, GIVE EACH CLASS MORE TALENTS. WATCH PEOPLE ENJOY THE GAME THAT WAS ONCE SO GOOD AND IS NOW SO BAD!", "author": "Annointer"}
{"url": "/forums/en/wow/topic/20752517231", "title": "Guardian Displacer beast", "replies": "6", "first_post": "Hello, I would like to know the reason why guardian are losing displacer beast. Displacer beast is the go to talent for a lot of gardian. Mainly in mythic + and in raid where moving out of thing asap and often is important. I mean warior have heroic leap monl have roll, demon hunter have their jump paladin i think have their horse and dk can immune most of the stuff. Blizzard is removing displacer best and giving us a fear instead in a mobility talent row. Improved inc roar is interesting and i m sure it will have is niche but when i m taking displacer best i want to move out of stuff not move in and i dont want to be able to move out fast only 1 time every 2 min or so, So I would liek to know the resoning behind this unfair pruning. and please dont call it a class fantasy been able to shapeshift is part of been a druid", "author": "Leetah"}
{"url": "/forums/en/wow/topic/20752649808", "title": "Suggestions for Improved PTR Communication", "replies": "11", "first_post": "Just to put this out there up front, please try and keep this constructive. I really want to avoid this turning into a \"F* Blizzard\" \"You guys Suck\" \"Unsub to teach them a lesson\" thread. I would like to keep this focused around what Blizz can do to provide better communication specifically with the PTR Cycles (since this is on the PTR Forums). I thought of three to start, that seem to be the most common things i saw throughout the PTR Cycle for 7.1.5 Patch Notes for PTR Builds It seemed like one of the biggest issues with the PTR Cycle was that pretty much the only source we had for build patch notes was third party sites like MMO Champion and WowHead. And that came with frequent communication from Blizzard saying that \"their datamining isnt completely accurate, ignore it\". In my opinion, the class changes and such for a PTR Cycle should be available via official, accurate patch notes directly from Blizzard and we can rely on third party sites for data mining other things like new achievements, new mounts, etc. Personally I really liked the format that the beta cycles had where there was one set of patch notes, and every time a build was released, the notes were updated with the latest changes. Can we get that for PTR Cycles as well? Doesnt need to be anything terribly detailed, just a list of the class changes that we can know is accurate. Cause the alternative is third party sites datamine the changes, Blizzard says their datamine isnt accurate, players get upset about some datamined change, Blizzard has to step in and say that was a tooltip error and it wasnt changed, player gets confused, no one knows what is accurate anymore. Class Specific Goals and Problems you are trying to fix Another major issue I saw throughout the class forums and this forum is that the players have no idea what problems you are trying to fix in the PTR Cycle, so when we see the changes (without any context for the change) we tend to get angry and upset because x was nerfed or some spell was touched when there is another spell that is a bigger issue and then we come here begging for communication because we are lost as to what you are trying to do. In my opinion, if at the beginning of the PTR Cycle, before ANY changes are made to the classes, if you posted something that listed all the specs (or just the ones you are planning on working on) and listed the issues you are trying to fix ... then we would know what you are trying to do so the changes hopefully make more sense. As an example, for mages, if at the beginning of the PTR Cycle you had posted something like the following, i think we would have understood things a little more ... Fire Mage: Too much of Fire's damage is inside the Burst Phase (The Combustion WIndow), we want to take away some of the damage from the Burst Phase and buff up their sustained damage to match Arcane Mage: Quickening dominates the spec and creates a lot of issues. We want to change around Arcane's talent tree so we can balance Quickening with the other options so Quickening isnt a guaranteed choice. Overall Secondary Stats: Secondary Stats have dominated gear too much making them in many cases more valuable than primary stats. We would like to balance this better so that the Item Level/Primary Stats on gear matters instead of an item being worthless because it doesnt have x secondary stat. I believe that something simple like that at the BEGINNING of the patch cycle would make all the difference. With that information, we can focus our feedback around those goals and problems that you posted. So now we can make our feedback relevant to your goals as opposed to just reacting to whatever the latest build had in it. Easily accessible information All of your communication regarding the PTR Cycle should really be posted on the PTR Forums where your testers are going to be able to see it easily. We shouldnt have to follow the PTR Forums, Twitter, Third Party Sites, Q&A's, Developer Interviews (third party interviews), etc. just to be able to get all the info about the PTR Cycle and Changes. Otherwise it turns into \"Well they said this on twitter, and then in this interview with X they said this, the datamined changes said this, and in the Q&A they said this ...\". Its fine if you post things via other mediums, but anything related to the PTR should be posted (or copied) here where it is easily accessible. Those were just a few that i came up with, if anyone else has something they would like to see in regards to communication, feel free to post it. Overall I just think that a LOT of communication concerns can be alleviated by giving some basic info up front instead of halfway through the ptr cycle, or as the cycle is completing (if its given at all). Especially if you want our feedback on changes, we need to know where the goal line is!", "author": "Sharrq"}
{"url": "/forums/en/wow/topic/20752658629", "title": "Fix legendary Upgrade Quest line.", "replies": "31", "first_post": "http://www.mmo-champion.com/threads/2141137-Legendary-Upgrades-Apparently-Gated-behind-Illidan-Quest-line TLDR - people on PTR recently discovered the legendary upgrade item is gated behind the illidan storyline quests, which on PTR still has an 8 week time-gate of collecting 80 souls w/ a 10 per week cap. i have no clue how to even start this or get to the point but i have not done it because i do not ever do lore chains and worthless quests.. this should not be a requirement to upgrade a legendary, plz fix this!!!!!!!", "author": "Vexea"}
{"url": "/forums/en/wow/topic/20752440112", "title": "Holinka vs Sargeras", "replies": "4", "first_post": "Both are hell bent on destroying life on Azeroth! Who is more evil?", "author": "Lilsmalls"}
