{"url": "/forums/en/wow/topic/20752551005", "title": "Marksmanship 7.1.5", "replies": "82", "first_post": "Given that the protection rotation, abilities and playstyle are undergoing perhaps the most radical changes of any spec except shadow priests can you get us a blurb from the Dev in charge of these changes explaining them to us? Specifically I would be interested in knowing: Why was it felt Protection Warriors were in such a bad place that they required such a dramatic change? Why it was felt that off GCD rage spenders like Focused Rage are 'Bad'? Why it was felt that the changes to Revenge alleviated the Focused Rage 'problem'? Why was off GCD Focused Rage a problem, but abilities like Maul remain? Why did they feel so strongly about this that they reneged on their promise to not drastically change a spec mid expansion? What is the design logic behind Devastator, what makes them believe, (contrary to community belief) that this ability's DPS component will not make it mandatory? Why were common suggestions from the community not considered? (Make IP scale better, have Revenge provide % chance @ SS resets etc...) Are they happy now with Protection, can we expect more changes of this magnitude in the future? I have mastered the 7.0/7.1 Protection Warrior and love it to death. I refuse to play Protection Warrior in it's current 7.1.5 incarnation, and many others are in the same boat. Since it's been deemed necessary to make these changes, please at least respect our feelings and give us a proper, decent explanation.", "author": "Markusv"}
{"url": "/forums/en/wow/topic/20752500201", "title": "@Ornyx - Can Prot Warriors get a response?", "replies": "82", "first_post": "Notwithstanding that the good idea fairy on the Dev team thought that a mele hunter would be exciting, Survival has failed miserably as a concept. Rather than accepting this fact, they instead try to force it down our throats by making it more powerful and nerfing what was the most viable raiding Hunter spec. After spending this whole expansion dumping AP into my MM weapon, I guess I'll have to start all over and try BM or completely abandon the class that I've been playing since launch. Very disappointed with 7.1.5, sigh.", "author": "Cartavius"}
{"url": "/forums/en/wow/topic/20752630239", "title": "MM Hunter killed for the sake of Survival", "replies": "2", "first_post": "YOU GUYS ARE WRONG FOR IT! PERIOD. THIS GAME USED TO BE GLORIOUS AND YOU DESTROYED WHAT EVERYONE LOVED MOST! I HAVE PLAYED MAX LEVEL EVERY CLASS AND SPEC SINCE CATA AND YOU HAVE LITERALLY RUINED EVERY SINGLE SPEC AND CLASS. ITS UNREAL. NO ONE AGREES WITH WHAT YOU ARE DOING, ABILITY PRUNING HAS FAILED AS OBJECTIVELY AS THE WAR ON DRUGS, STOP COPYING MOBAS BECAUSE YOU CANT GRASP WHY YOUR GAME IS FAILING, CLASS DESIGN, UNIQUE ABILITIES, CLASS FANTASY, CLASS UTILITY, THE CORE OF YOUR GAMES SUCCESS HAS BEEN UTTERLY GUTTED. WHAT ARE YOU GOING TO DO WHEN LEGION HYPE WEARS OFF? WE ALL KNOW THIS WAS THE KEY EXPANSION FOR YOUR GAMES SUCCESS! UNSUBBED AND IT NEVER FELT SO GOOD! YOUR THREE CHOICE TALENT SYSTEM IS A JOKE. EVERYONE LIKED THE OLD TALENT SYSTEM FROM BC/WOTLK BETTER, YOUR REASONS FOR CHANGING IT WERE FALSE AND IDEALIZED BS! HERE IS THE RIGHT IDEA: GIVE EACH CLASS MORE ABILITIES, GIVE EACH CLASS MORE TALENTS. WATCH PEOPLE ENJOY THE GAME THAT WAS ONCE SO GOOD AND IS NOW SO BAD!", "author": "Kerrinn"}
{"url": "/forums/en/wow/topic/20752430435", "title": "HEY BLIZZARD, NO ONE LIKES ABILITY PRUNING", "replies": "2", "first_post": "Warning: Sorry in advance for the huge wall-o-text. I've been playing with the new changes to talents that we've seen in 7.1.5 and so far, I can't really say I'm pleased with the results thus far so here's my feedback on the current (and certain previous)changes to Affliction and talent in general. - Drain Life being switched with Drain Soul: I won't lie, myself like many others felt that the Drain Soul we'd be getting would be the one we have on live, not one that deals 3% less damage than Drain Life does on live. Drain Life on Live: 270,777 over 4.9 seconds Drain Soul on the PTR: 262,826 over 4.9 seconds Seeing as Secret of the Necrolyte isn't on the PTR, I doubt that this is just a bug and it feels more like an actual nerf which means we just trade a green beam for a purple one and also a huge nerf survability wise, seeing as Drain Soul heals for 30% less than its green counterpart, a nerf which comes on top of the switch of talents that made Demon Skin being unable to be picked with Dark Pact and for that nerf we get a soul shard on defeat. A very disappointing change, if intended. If not, I hope the damage will be increase to match the one we have on Live as Affliction could desperately use some form of single target damage increase. - Reworked Haunt: The talent itself seems way contradictory. It feels like it was designed for quick burst on short lived adds, which at first seems nice until you go to the part where it also increases our damage against that target by 10% for 15 seconds. The bad thing with that is that for one, short lived adds never last the 15 seconds so by the time the add spawn and that Haunt reaches it, we have no DoTs on the target yet and it's already close to being dead which leaves us to maybe (depending on our current shards) being able to cast an Unstable Affliction and having a very slight buff to it or just Drain Soul then see the add die. Being able to do so little as Affliction during that short time frame (due to Affliction terrible ramp up issues), it just feel like that part of the talent is close to being entirely wasted. In the rare case they do live more than 15 seconds, an Agony by itself will be a better use of a Global, especially if we took Writhe in Agony which just makes it in the end a very confusing change. If we take that talent in single target, it's just a slightly less than 5% damage buff to our shadow damage(taking into account its cooldown, duration and missile speed which also means by the way that it cannot even benefit from its own effect) if we use it as soon as it comes off of CD, which doesn't even compare to Writhe in Agony, which is clearly a talent that trumps in ease of use, general usefulness and damage throughput. Writhe in Agony: A very powerful talent, it just needs to be baseline as nothing can really compete with it on its row without severely gutting it, which would only create even more issues to a spec riddled with them. Reworked Malefic Grasp: This current iteration of Malefic Grasp is....quite sad when you see what it used to be. It lost its ability to proc DoTs which means that we cannot use it to help fish for Compounding Horror(which I will come to later) procs nor can it help Agony proc which would help to reduce Affliction's horrendous ramp up time. It also play terribly with Soul Effigy as you're effectively inputting less damage into it which means less damage done by Effigy overall while not helping our already low channeling usage, which we often have to break for mechanics. I feel the only solution for it is to bring back its old iteration, like it was in MoP, tune it accordingly and make it replace Soul Effigy or if that does not happen, at the very least change its position in the talent tree as it is clearly a bad talent for the first row. I wouldn't even mind seeing it take Howl of Terror's spot Demonic Circle: Needs to be brought back baseline. It's been a signature spell for Warlocks for a long time and right now in its current iteration, it's literally broken if you want to place your portal at different location mid encounter(unless you make a macro for it but I feel making a macro to make a spell behave like it's supposed to is bad design). Put Burning Rush in its spot and Dark Bargain in Burning Rush's previous location (would also help with the mentioned doubling down on strengths, seeing as it is a survability talent). Contagion: I feel that for a talent which you need to monitor to be able to keep an high up time on, it lacks throughput. Absolute Corruption, while being a clearly designed multi-target talent is only ~2% under it on single target and that's theoretically speaking. In a real world scenario, the saved global and its ability to be there permanently makes that 2% even less. I think it should at the very least have its previous nerf reverted.", "author": "Annointer"}
{"url": "/forums/en/wow/topic/20752335415", "title": "Affliction Warlock 7.1.5 Feedback", "replies": "17", "first_post": "Blizzard nerfing Sub Rogues for patch 7.1.5, this is not what we needed, you are making Subtlety spec burn in ashes... Being that Sub Rogues are not even on the top of the DPS meters and for the spec to even be viable in PVE/Raids, we require Shadow Satyr's Walk Legendary boots. as such you have nerfed the following, which is completely screwing us over. ... As a Subtlety Rogue, the only thing that makes us viable is having energy regeneration which allows us to complete a full combo/finisher rotation with Deeper Stratagem. ... If Shadow Dance is to last 8 sec, Subtlety Rogues are then able to fulfill a 3 finisher rotation which will properly restore Shadow Dance charges. this will also make the other Talents \"Nightstalker\" and \"Shadow Focus\" viable. Currently, you have thus far shown how inexperienced you are with the Subtlety class, and that you are completely trolling us with your constant nerfs to what is essential to our spec being viable, and are instead hurting us to the extreme which can cause us to not complete a full damage rotation. Do you not think that there is a problem when Subtlety Rogues require the Legendary boots Shadow Satyr's Walk just to be a viable spec? the only way we are viable is by having Deeper Stratagem which increases our overall damage, you've just nerfed this, and our energy regent, in turn our dps has dropped by over 50k... Please find someone who knows how to play, and can better balance out the Sub Rogue spec. because obviously all you want to do is destroy the Sub class.", "author": "Elenath"}
{"url": "/forums/en/wow/topic/20752325763", "title": "Subtlety Rogue Nerf 7.1.5", "replies": "19", "first_post": "Hello internet friends, My name is Bay. I am the Director/Host/Producer of FinalBossTV & I have been playing Enhancement as my main since the space goats fell from the sky. We have come a very long way, with Legion, from the old designs of Enhancement's past...but with all change comes new problems that require solutions. Detailed in this post are some of the top concerns put together by a handful of Enhancement players from around the world that have kept in communication since MoP about the state of the class. We just hope to make it the best it can be and it’s understandable that some talents have issues since the focus in Legion was the core of the class. (*Years playing Enhancement.) Credits: Wordup <Echoes> | 9 Years Played Purge <Addiction> | Lots of Years Played Rusahh <Addiction> | 5 Years Played Hekili <Turbo Cyborg Ninjas> | 3 Years Played Ryethe <Midwinter> | 8 Years Played Bay <Crisp> | 9 Years Played------------------------------------------------ Talent: Ascendance Problem - Ascendance is too unreliable to be our major cooldown option in the 100 talent tier. When receiving many Stormbringer procs the ability is very fun to use, but more often than not we receive very few. When receiving no Stormbringer procs during its duration we only get 1-2 uses of windstrike during the duration. This ability has no protection against poor RNG which makes it a poor talent choice over the consistent bonus provided by Landslide’s Agility. Additionally, the maelstrom generation it provides is redundant as we are usually overflowing with maelstrom from other effects during the duration and having more maelstrom that we can’t even spend in most cases - permanently being capped and unable to spend/dump - does not feel very rewarding at all. Cooldowns, by design, need to be reliable for burn periods. Suggestions - A) Change the maelstrom generation to either a lower cooldown on Windstrike, 4.0 - 6.0 base CD would both allow for a minimum of 3-4 Windstrikes even at lower levels of haste which would increase the use of our major button while ascended. B) Or change the passive to be something similar to Metamorphosis with a passive haste bonus that would allow for a higher chance to proc Stormbringer with auto attacks, allowing for more maelstrom generation with said auto attacks, and lowering the cooldown of Windstrike naturally because of the added haste granted while ascended. Goal - The purpose of either, or a mix of, these suggestions is to bring Ascendance up in reliability as a talent choice for actual Burst Damage. Currently it \"can\" do that only if you have good RNG. And having to rely on a chance to do good burst, and then be on cool down for 2 minutes 45 seconds, is not very impactful. The Shaman should feel powerful while Ascendance is active. Currently you do not unless the dice gods smile upon you and you have feel-good Stormbringer RNG. There is already a hefty load of RNG in the base rotation from: Stormbringer + Stormflurry, Unleash Doom and Feral Spirits. (Due to their elemental bonuses not being controllable/not equal in effectiveness.) Talent: Sundering Problem - Sundering does not have scaling factors to keep it in line with Crashing Storm and Fury of Air. Currently it scales in physical damage based on Attack Power. There is no Mastery or Haste scaling, which the other two talent options have. Crashing Storm: AP / Haste / Mastery / Vers / Crit (as Nature Damage) Fury of Air: AP / Haste (Uptime) / Mastery / Vers / Crit (as Nature Damage) Sundering: AP / Vers / Crit (as Physical Damage, reduced by armor) Suggestions - Add both Mastery and Haste scaling. Convert spell to Fire or mixed spell damage school. Allow 2 charges to separate it as our burst AoE option. Goal - Enhancement is severely lacking in the Burst AoE category and this is a great place to do it. Re-tune damage as needed around these changes. And yes, not all Classes/Specs need to have every option available but it's damage is so minimal due to being physical it would need to be buffed by 80% or more to make it compete (in it's current state) with Crashing Storm or Fury of Air. [Part 1 of 3]", "author": "Phay"}
{"url": "/forums/en/wow/topic/20752567123", "title": "[Feedback for 7.1.5] State of Enhancement", "replies": "161", "first_post": "Are we going to get one or not? Please answer!", "author": "Bay"}
{"url": "/forums/en/wow/topic/20752546080", "title": "@Blizzard Momentum reset in 7.15", "replies": "15", "first_post": "MAKE OUR VOICES HEARD", "author": "Lilithsitri"}
{"url": "/forums/en/wow/topic/20752541296", "title": "STREAM NOW HUNTERS LETS GO", "replies": "1", "first_post": "This thread is a support group for victims of 7.1.5. Counselors will be available between the hours of 9.00 - 16.00 Monday to Friday. If you believe you are at risk of harming yourself or others, please contact your local emergency services. The rules are: 1. No bullying. 2. No spec-shaming. 3. Posts may contain positive elements but must be overall negative. Please remember that YOU ARE NOT ALONE, and that there are people out there who love and care.", "author": "Ladihoodwink"}
{"url": "/forums/en/wow/topic/20752440642", "title": "Support Group for Victims of 7.1.5", "replies": "15", "first_post": "Lets talk about Feral druid changes here as I think a general druid thread will becoming awash with too many different discussions. Issue/Bug: -Visual indications of Predatory Swiftness are no long present (no lighting up abilities or showing indication above character) Discussion: -Omen of Clarity Change: Omen of Clarity now only affects Shred, Thrash and Swipe. Not liking this, rotation isn't as fluid and you are certainly hurting with Energy especially if you consider using ferocious nibble(\"bite\") at 50 energy without it. I feel this will likely impact our multi target capability with Rake/Rip (or just in general) and I feel it was only done because of the change to Moment of Clarity (+15% damage) and to perhaps boost the appeal of SotF. Energy management is critical to Ferals and having Omen usable on any ability has been ingrained in our spec for a long long time. I don't like the idea of only benefiting basically 1 CP generating ability (swipe is situational).", "author": "Shìvers"}
{"url": "/forums/en/wow/topic/20752265059", "title": "[Feedback] Feral Druids", "replies": "268", "first_post": "Rogue forums are filled with highly upvoted threads asking for Legion changes to be entirely reverted. We hate this new version of our class and we hate you for forcing it on us in spite of the overwhelmingly negative feedback.", "author": "Delowen"}
{"url": "/forums/en/wow/topic/20752450709", "title": "Unprune Rogues", "replies": "2", "first_post": "Well now that they introduced \"proc protection\" for the new spam arcane shot spec, Sidewinders is bugged. Sometimes when you proc marking target and then use it, you will not get to use Marked Shot, because it does not consume the proc. This is very bad to have in place for sidewinders where you only have 2 charges on a long CD and need to use the proc right then. Not only did Blizzard destroy this talent option in general, but now with the changes it doesnt even work many times.", "author": "Ghostshoes"}
{"url": "/forums/en/wow/topic/20752621236", "title": "Sidewinders Bugged.", "replies": "1", "first_post": "does anyone know when the next patch will be on ptr?", "author": "Ninjeff"}
{"url": "/forums/en/wow/topic/20752489932", "title": "Quick question", "replies": "2", "first_post": "The recent PTR updates to Warriors, specifically the fury specialisation really miss the mark in terms of talents. Fresh Meat - Bumping this up to 60% increased crit to Bloodthirst still doesn't make it worth using ever for the fact that the first 20% of an enemy's health is always the fastest point as everyone is using their cooldowns and Heroism / Bloodlust is in effect completely nullifying any effect this talent will have over the superior Endless Rage or War Machine. Outburst - It's a joke that reducing it to a 45s CD is what is defined as acceptable for talent balance. This will never compete with Avatar or Wrecking Ball unless some extravagant effect is added on top. Reckless Abandon - I like the change to this, providing a slightly higher Battle Cry uptime, however the fact that the rage is still given in one large chunk with fury only having a rage cap of 100 is still not productive. Reckless Abandon in conjunction with providing an extra 2s to Battle Cry's duration should also grant 50 rage on use and a further 50 rage over 3s. What this will allow is for rage to not be wasted as Fury already generates a large amount of rage with their opening charge, this will also make the talent more attractive. You've proved with the new guardian legendary Oakheart's Puny Quods that you can do this. Dragon Roar - The nerf is unwarrented, given that Reckless Abandon is on par with it in terms of damage on live where Dragon Roar provides a playstyle players enjoy and provides a boost to AoE throughput. Massacre - Why is this not baseline still? You stated you were looking to make certain talents that were required for a spec to function baseline and this hasn't been adjusted yet? It's literally the ONLY option to take on it's tier to make pressing execute over rampage sub 20% even worth it. Juggernaut - It's 5% damage increase per stack up to 99 is totally not required. For one it takes way too long for the Fury Warrior to build up their execute to a respectable level. The stacks should be limited to a maximum of 10/20 and it's buff to be increased so the warrior doesn't lose a massive stack of juggernaut because they had to react to a mechanic which is upsetting when it occurs. Double Time - Another talent that should be baseline for both Arms and Fury, it's complete garbage having to choose between a mobility vs a stun. No other class has this decision to make and for a great reason it's silly. What should replace it? Warbringer of course allowing for all warrior specs to choose between Shockwave / Storm Bolt or Charge Stun. This will in no way make Warriors overpowered as their only baseline CC is a 90s AoE fear. Blood Bath - It's cool down @ 30s is a big issue in the fact that it doesn't line up with Battle Cry which in itself is a 50s CD after taking Helya's Wrath. The DoT effect is also too long as it takes 12s to get the most out of the bleed effect, even in a mythic raid setting on prog most AoE sections don't last this long therefore damage is wasted. Now if the DoT effect was set to 3s it would be more reasonable as you would be able to get it's full effect within 9s. Frenzy - Fury loves haste, why do we never spec into this talent? For one reason only, Furious Slash is barely ever used so keeping up this haste buff is a chore and not worth it. How could this be fixed? By allowing either Bloodthirst or Rampage to refresh the Frenzy effect and Furious Slash to stack it, this allows for a better playstyle for the warrior as the only time Frenzy will drop off is if the warrior is not keeping on target. If you insist on Frenzy only being applied by Furious Slash, make this talent merge Raging Blow and Furious Slash into a 1 button filler attack that deals Medium damage providing a haste buff and the bloodthirsty effect (animation would be alternating MH / OH slashes much like in d3). Bladestorm - A once iconic ability now in the dog house never to be used by another Fury Warrior in Legion as it's not able to be covered completely by enrage. How do we fix this? Make bladestorm always deal damage as if enraged, if you would like make an aura that applies enrage so the Fury warrior who is bladestorming is also susceptible to an increased damage intake. It's cool down could also be lowered to ~50s to line up with battle cry a little better. Rampage - It's 2s GCD/\"channel\" isn't exactly the best interaction in a spec as it's reduced awkwardly by haste. This also causes some poor interactions with short term buffs such as Battle Cry as using it under said windows lowers your total GCDs in the window at the expense of using an ability with mediocre damage. This in turn also lowers it's synergy with Reckless Abandon / Dragon Roar if used within them. Fixing any of the above issues would be a huge step in fixing a broken talent tree that's sorely needing some love mechanically for the Fury Warrior.", "author": "Idiotgodx"}
{"url": "/forums/en/wow/topic/20752217843", "title": "7.15 Fury Talent Feedback. Stop, Listen.", "replies": "674", "first_post": "Seriously? Not one comment? Not even one? Just ignoring the thousands upon thousands of posts and replies about this. He'll even people who arnt hunters understand. Come on Blizz. There were 1500 replies on ONE post about the changes in PTR and that was ignored. They roll it out live. Now even more outrage and silence. GG blizz.", "author": "Greìl"}
{"url": "/forums/en/wow/topic/20752501239", "title": "No Blue Post about MM????", "replies": "10", "first_post": "Well guys, it was nice finally being good. But blizzard doesn't want that it seems :) vile gas damage reduced by 40% to \"compensate\" for it ignoring armor, even though our damage was clearly not broken by this in any way shape or form. Shadow infusion is already the weakest talent of the tier, might as well make it worse. Source: https://worldofwarcraft.com/en-us/news/20478238/hotfixes-january-10 Honestly it's ridiculous. Unholy has been undertuned since legion hit. The spec is not by any means at the top of the charts now. Do you guys just not want us to play the spec? I seriously don't understand.", "author": "Kîttycat"}
{"url": "/forums/en/wow/topic/20752560416", "title": "Unholy nerfed one day after patch hits", "replies": "9", "first_post": "While I'm pretty happy about the substantial buff to execution sentence in the coming patch, I'm still a bit concerned about it's viability to compete with Templar's Verdict. The problem that I see with ES regardless of the buff is that it does not benefit from echo of the highlord, whereas TV does, in addition to being buffed substantially by the final verdict talent, and most importantly ES has extreme anti-synergy with our bis legendary, cloak of the nathrezim. I have the cloak, and while I haven't tested it with the buffed ES on the PTR, just playing with ES on live feels really bad when you have the cloak, because using it on CD more often than not wastes the TV buff from your cloak buff (not to mention a substantial dps loss). I don't know if buffed ES does competitive dps even with the cloak, but the mere fact that it feels inefficient to use with the legendary cloak makes me not want to take it. This disappoints me, because I was really excited to use ES again. Currently ret feels highly rotational, and this is made worse by the fact that we are never building up to anything other than TV chains. I feel that ES would do a lot to spice up the rotation for those of us who are getting bored with the current playstyle with final verdict. As such, I think Cloak of the nathrezim, and possibly even echo of the highlord, should also apply to execution sentence, or maybe just holy power spenders in general. Final Verdict could remain a competitive choice for those who don't want to play with ES, or who want more aoe potential with divine storm. I would love to know what the ret community thinks about this.", "author": "Tomyre"}
{"url": "/forums/en/wow/topic/20752398792", "title": "Execution Sentence viability in 7.1.5", "replies": "5", "first_post": "Demon Hunters are stupid. Thanks.", "author": "Aeloren"}
{"url": "/forums/en/wow/topic/20752620926", "title": "LOL NICE BALANCE BLIZZARD", "replies": "8", "first_post": "I'm waiting for next week to see what will happen when 7.2 hits, many players feel discouraged to play their spec and even class because of the Class Balance. I'm curious what Blizzard expects when 7.2 goes live, players being awed like an idiot at Nighthold and Class-Mounts??", "author": "Holzybeballn"}
{"url": "/forums/en/wow/topic/20752501282", "title": "What do you expect next week?", "replies": "1", "first_post": "op: https://eu.battle.net/forums/en/wow/topic/17614514694 Give us a reason to be brought into raid please. PS: Blizzard, please don't ignore your playerbase by giving us shxtty replies like \"your spec is really strong just people don't play it too much\". That is a meme and an excuse for your terrible class balancing, as I don't see any of your mathematical prove here.", "author": "Conkers"}
{"url": "/forums/en/wow/topic/20752557115", "title": "MW Monks desperately need a second look", "replies": "115", "first_post": "https://us.battle.net/forums/en/wow/topic/20752580611?page=1 Here is some class feedback from the enhancement shaman community. Obviously, majority are not happy with the changes at all. A loss of dps is unfortunate, but I think more or less the frustration comes with the fact that our rotation went from being smooth to playing like a game of \"whack a mole\". All of this while losing trait interaction from our weapon and to a degree a somewhat harder rotation with bugged abilities. As if that wasn't enough two of our legendaries require the use of the hailstorm trait for frost damage application, but hailstorm was nerfed so hard that even if you were to have the ring (1.5%) damage bonus and the bracers it's still a net loss. No one should have to use a legendary that makes them lose damage.", "author": "Stcola"}
{"url": "/forums/en/wow/topic/20752650222", "title": "Enhancement Shaman 7.1.5 Feedback", "replies": "1", "first_post": "So I use the AK catchup to boost to 20 AK, gives me AK 18.. I had a research note ready so I used it.. got 19.. wtf? So I go buy another compendium on my main to boost it from 19 to 20 like it was supposed to.. Says I already know everything it can teach me.. apparently not because IM AK 19!", "author": "Martenluther"}
{"url": "/forums/en/wow/topic/20752550755", "title": "Got screwed on AK catchup.. bug?", "replies": "11", "first_post": "I'd like to formally request an Artifact Power reboot with 7.1.5 with the ability to use earned points to a spec of our choosing. I'm not crying about any class or saying Blizzard is doing something wrong. I simply feel like the refund is warranted with the overall changes being done to classes that is beyond the players power to control. Blizzard stated at the outset that any changes to classes would be minimal due to the very nature of Artifact Power. The changes and balances are a necessary part of the game and I understand. But please understand the frustration created after months of work feels wasted due to something out of the player control. I'm aiming for the middle ground here...between the lower end solution of refunding Artifact Power to a single spec and the high end solution of Refunding the Artifact Power for an entire account so someone can choose a new class if the changes are too much. Though I would love to see Artifact Power earned be account wide...I'm doubting that will happen.", "author": "Dotfearun"}
{"url": "/forums/en/wow/topic/20752335268", "title": "Request for AP refund in 7.1.5", "replies": "232", "first_post": "Will I be able to stock up on tokens now or should I wait? I'm expecting a steep price increase so I'd like to buy them now if it's going to be retroactive. Anyone know for sure?", "author": "Maganus"}
{"url": "/forums/en/wow/topic/20752597604", "title": "Token -> Battle.net balance retroactive?", "replies": "5", "first_post": "At this point, asking for a major change in MM hunter rotation will be impossible. It took Blizz 2 months to cook out this messy/RNG heavy/stationary rotation. So long story short, should blizz give MM hunter a dmg modifier like what they did with BM Hunter or Fire Mage? Note: The current issues are still there, this is just a quick fix IMO so MM hunter can go to NH!", "author": "Yagato"}
{"url": "/forums/en/wow/topic/20752570924", "title": "MM hunter DMG modifier", "replies": "1", "first_post": "I played in every expansion. This design for classes really sucks. I want the class Devs to know personally that it sucks. We need to be straight up honest because the content was done well but the class design is seriously bad. It's what I would expect from a game in the alpha stages. Here's why... We have less abilities than we did in BC. Even Vanilla had more and thats when most players were learning how to play mmorpgs You gave us more abilities in BC, Wrath, cata, mop and even WoD for some classes. You made most of your player base used to a design that had many abilities and THINGS TO DO while not waiting for RNG procs (marked shot). We even had unique combo abilities like Scorpid sting back in Wrath with chimaera shot would disarm a target and if the target had serpent sting it would do bonus damage. We had so much. You took away everything that made our class fun. So yeah.. the design sucks. No more pretending like things can get better from here on out. I know it sucks and others do too. I can't play Legion with this... pardon for the rudeness but weak design. So much effort was put into the content. And so much effort was put into removing class playstyle and abilities. That's not what the player base wanted. If the tradeoff for legion was good content but bad class design. I'd rather go with good class design and bad content. Your class design previous expansions and in Vanilla is what made your game superior against any mmo. Every other mmo has such terrible design and non fluid gameplay Apologies for the rudeness. I just love this game is all. ...", "author": "Fénharel"}
{"url": "/forums/en/wow/topic/20752589557", "title": "The Class design this expansion", "replies": "27", "first_post": "Why you insist on changes that nobody likes so far? I don't understand your motivation behind this idea. I have yet to see one post saying good things about you've done with mages. We had alot of work farming AP. Why don't you let us have fun? It's already bad with your awful anti-bad luck system and stupid legendaries. What's the point on playing a game that favors few playstyles?", "author": "Boocraft"}
{"url": "/forums/en/wow/topic/20752607046", "title": "7.1.5 THE \"I QUIT\"  PATCH", "replies": "340", "first_post": "Prior to 7.1.5, mained my survival hunter. Loved the fluid game play, and that hasn't changed much. I only have one real complaint, and its a very minor one at that: Why change explosive trap to targeted ranged/why isn't there an option to auto cast targeted spells in the combat menu. Its a minor issue, but personally it disrupts the flow of the Spec. The utility i get from the range is relatively insignificant. On paper, the change is a buff, but personally see it as more of a nerf. As far as the option goes, that would help solve not only my issue with the change, it would help other classes feel a bit more fluid. Granted, they have removed a lot of those spells from the game, like from shaman and warlock. ultimately I'm being whiny and nit-picky, but part of keeping a melee dps class fun is having good flow to the combat.", "author": "Throllu"}
{"url": "/forums/en/wow/topic/20752621089", "title": "[ Feedback] Survival Hunter", "replies": "4", "first_post": "all i have is to make a level 1 or trial 100 like on live", "author": "Alendryl"}
{"url": "/forums/en/wow/topic/20752430320", "title": "how do i make a level 110", "replies": "3", "first_post": "This game is !@#$ìng dead im quiting this pos %^-* game blizzard buffed DH when they were already op as hell it's bullshìt just... bullshìt.", "author": "Ratedmxa"}
{"url": "/forums/en/wow/topic/20752501048", "title": "WoW IS DEAD bye everyone", "replies": "9", "first_post": "I appreciate the attention given to shadowpriest AoE, but baking it into mind flay, traditionally our single-target filler, is unnecessarily cumbersome. There were situations where Mind Sear was actually very useful (it deals its first damage tick immediately; better at clearing low-level trash when soloing old content). What I'm not getting is why the dot-echoing that's being added to mind flay couldnt' have been added to Mind Sear. It's not like we're running out of space on our action bars after the ability purge that predated Legion. And as payment for this unwanted adjustment, I now don't have an efficent way to clear large amounts of low-level enemies; my understanding of the new Spriest AoE is that the aoe locus would die either from the first tick of a DoT, or the first tick of mind flay. TLDR: I'm not seeing the benefit of losing Mind Sear. It was stated in the recent blue post that Mind Flay will now serve \"a similar purpose,\" but by my reading it will be strictly inferior for that purpose in a number of situations, and I don't think Priests are so encumbered with buttons to press that we can't deal with having to choose between Flay for single target, and Sear for AoE. Edit: Oh, and Twins' Painful Touch (credit to replies for pointing this out). Being able to strategically hold the Mind Sear to spread DoTs in Voidform was an interesting and useful mechanic. Since Mindflay is our default filler, it seems to me that this utility is lost.", "author": "Hedgehogz"}
{"url": "/forums/en/wow/topic/20752440112", "title": "Holinka vs Sargeras", "replies": "4", "first_post": "Both are hell bent on destroying life on Azeroth! Who is more evil?", "author": "Lilsmalls"}
{"url": "/forums/en/wow/topic/20752610281", "title": "So We are Unsubbing again right ?", "replies": "45", "first_post": "want your voice heard , hit um where they feel it most ; that fat pocket book. Have a good day. Calling for a strike", "author": "Provoake"}
{"url": "/forums/en/wow/topic/20752429529", "title": "The class Devs are bad at their jobs.", "replies": "29", "first_post": "You guys can delete the posts but it doesn't change the fact that this patch isn't anything we were promised from a class balance perspective and many classes feel worse than they did in 7.0. I was all for making patient sniper less mandatory or for making sidewinders not always the go to, but in the thousands of posts since alpha you've seemingly taken the worst possible approach each time and managed to throughly butcher one of the most fun classes in the game. Good job. You took one of the best mmos on the market in the last decade and reduced the classes to steaming piles of garbage. If you can't handle this truth to the point where you need your CMs to delete posts that call you out on this trash maybe you should \"get out of the kitchen\" so to speak. I can't be the only player who feels this way either considering the current state of those forums. Man up and just revert the classes to MoP so we can at least enjoy the rest of content In this expansion.", "author": "Lekai"}
{"url": "/forums/en/wow/topic/20752620336", "title": "Patch notes?", "replies": "10", "first_post": "Am I missing something? They advertised the patch notes in their own little video short, but I can't seem to find them. Now before everyone tars and feathers me, aren't you guys jumping the gun a little? Nothing is really set in stone yet from what I can tell. Another thing I would say is, every class has been in a state of flux ever since the game was created, and have all had highs and lows. So you might not be as overpowered when the patch hits, but why does it mean jump ship or play flavor of the month? Honestly, and I mean this in the nicest way, but everyone is acting kind of like babies.", "author": "Murlackey"}
{"url": "/forums/en/wow/topic/20752659614", "title": "Sub Rogue - Disgusted with Communication", "replies": "37", "first_post": "I know we've been cautioned to not pay too much attention to the data-mined PTR information, or balance updates in general, as apparently things are perpetually in flux on the PTR. But it's impossible to do, really. Especially for Sub Rogues who haven't seen a single Blue comment regarding their spec since months before Legion even launched. What percentage of your paying customer base plays Subtlety? Is it thousands? Tens of thousands? Hundreds of thousands? Regardless of what the percentage is, it's legitimately awful that we haven't seen a single developer response to assuage any of our concerns. Some of those concerns being: 1) Energy management during our dance rotations, assuming we are one of the masochistic few who raid with this spec without Satyr's Walk. 2) Lagging behind on single target (again, without a completely RNG legendary) compared to Assassination rogues despite our much higher risk/reward play-style in raids. a) If we blow a dance charge and get targeted with Focused Gaze, or Rot, or anything that requires us to get out of dodge, there's very little way for us to meaningfully recoup charges during a single encounter. b) If we don't manage our shadowstrike buffer zone distance and suddenly the tank moves the target an inch and we teleport into a self or raid compromising position. Does Blizzard not want Sub Rogues in the raid environment? Our raid population numbers, when compared with Assassination Rogues, are paltry. I'd have assumed the goal was to increase those and create a more healthy mix of specs within raids - but maybe I'm wrong. Now our Nighthold 4 piece set bonus has been absolutely gutted, adding a massive amount of RNG into a spec that isn't really supposed to rely on it. To compound the issue it seems that the 4 piece bonus was the only thing that was finally going to improve our quality of life and rotation management (again, assuming we are one of the damned who doesn't have Satyr's Walk). Can we please, for the love of God, get a Blue response for Subtlety Rogues - what are your goals for Subtlety? What is the future to Subtlety? What will be done to address QOL concerns for Subtlety? I'm sick and tired of being left in the dark.", "author": "Rîxan"}
{"url": "/forums/en/wow/topic/20752669685", "title": "Shadow priest worth rerolling?", "replies": "4", "first_post": "To be clear my main is still my Disc priest but for DPS I want a DPS class to easily top meters with eventually. Usually for me this is hunter but right now it feels so wrong, sv is clunky like shadow and BM is no longer fun. Any recomendations? I would prefere pure DPS ranged so I guess Mage or should I go MM?", "author": "Getitoffme"}
{"url": "/forums/en/wow/topic/20752559762", "title": "\"Class Fantasy\" gets a bad rap.", "replies": "26", "first_post": "Whenever I see someone explaining something bad in the game by saying \"class fantasy\"... I die a little on the inside. I feel class fantasy has gotten a bad wrap and has become misunderstood to mean \"badly balanced.\" I just flat out disagree. Bad balance is bad balance. Class fantasy is a limited scope idea that basically served as the overall answer to the awful homogenization that started in Cata and basically peaked in MoP when every class could basically do everything. Dehomogenization should always be a goal... and that's all class fantasy was. Make a warlock feel like a warlock. Make a monk feel like a monk. Give the devil its due: when you're playing a Spriest, you don't feel like a Mage dyed purple. The issue they're running into is what, exactly, they are dehomogenizing. In PvP, for example, it's not a problem that every ranged character has a way to deal with melee. That's just called \"class balance.\" Unless you're going to do something like implement collision detection so you can literally \"form ranks\" and \"stand behind the tanks\"... you cannot have ranged classes that have no way of seperating from melee when they get on them. That's not a class fantasy issue, that's a stupid design issue. I don't want Blizzard to take the wrong message away - that we hate to love homogenization and go back to that route where every class had everything... but you can't skimp on the bare essentials: 1. Every tank needs to be viable. You can't have DHs, DKs and BMs pushing cooldowns to get what Paladins, Guardians, Warriors get by equipping a shield/going into Bear form... even if it is a short cooldown. That's not a class fantasy issue, that's a stupid design issue. 2. Every healer needs to be viable. Disc Priests are fun, but they need to be more accessable. You can't have this spec where if you aren't in the top 90% of healers, you can't make it work. Likewise, in PvP, you can't have 1 spec that can counter melee and all the others who cannot... otherwise you get RBGs looking for 3 Mistweaver monks. Again - not class fantasy. Bad design. 3. Every DPS needs to bring comparable sustained single target and AoE. Before Legion, AoE was a quality of life thing and could be comparable to utility. You could have classes that sucked at it... and that was fine. There was no such thing as a \"timed run\" other than niche Challenge modes no one really did or, if they wanted it badly enough, they just paid for a carry. With Mythic+s, good AoE damage is every bit as important as single target... because progression hinges on it. You CANNOT have Fire Mages and DHers dealing 2-3 million DPS on a trash pack while some specs have to blow every cooldown they have to even have a shot at 500-600k. That's as absurd as giving Mages 5x less single target damage, having them place under the tank in raid fights and saying: \"It's fine - their AoE damage is awesome. Every spec needs to have its weaknesses.\" No... it's not fine. Mages just won't be brought to raids, just like classes with bad AoE don't get brought to Mythic+s... and it doesn't matter if Ion has seen them once in a +15 video. That doesn't mean it's balanced. But the takeaway is: It's not a class fantasy problem that some specs deal crap AoE damage - it's just a stupid design issue. Blizzard, I love your class fantasies - you've made classes feel unique and fun. But you cannot have classes that underperform in core aspects of the gameplay. By the logic you've embraced, you might as well just create a \"Citizen\" class... where you can play the class fantasy of being a commoner in World of Warcraft. The heroic tale of a farmer who's had too much, picked up his pitchfork, and went to go raid the Emerald Nightmare... sure, he might deal 1/10th the damage of someone else, but boy does he feel UNIQUE! This is obviously an exaggeration. Bottom line: you can make classes feel and play unique and honor their class fantasies just fine... just don't give some the short end of the straw when it comes to basic, core gameplay.", "author": "Barrison"}
{"url": "/forums/en/wow/topic/20752675781", "title": "devs/game designers out of touch", "replies": "2", "first_post": "with the players of wow.", "author": "Knasth"}
{"url": "/forums/en/wow/topic/20752450613", "title": "bleah", "replies": "1", "first_post": "Overwatch is really doing great things on communication and Jeff posting a video for changes too,?! He is making alot of time for his community and I love it. Wow needs this standard of communication and it would be nice to get as many videos from Ion as Jeff does for OW. Your own company is doing a better job than your team. Also I thought we were suppose to get one more QA before 715 releases? Did I imagine that.", "author": "Lawlygaggin"}
{"url": "/forums/en/wow/topic/20752429442", "title": "Kaplan OW and WoW", "replies": "6", "first_post": "As the title says, I have a question about the Artifact Knowledge catch up mechanism. With the changes to frost mages and my moderate luck with legendary drops, I am considering benching him for a warlock I have at level 100. Can I use the AK catch up to get the Lock to level 20 AK at level 100 or do the catchup items require level 110? Thanks, Morei", "author": "Applefriter"}
{"url": "/forums/en/wow/topic/20752489416", "title": "A question about AK catch up", "replies": "2", "first_post": "Hello everyone and Blizzard Developers. I have a quick question regarding the consistency of the World of Warcraft. How is it that when Dalaran moved to the Broken Isles, it left a copy of itself behind in Northrend, but Naxxramas couldn't move to Northrend without leaving a copy of itself in Eastern Plaguelands? For the sake of consistency, can we please either put Naxxramas in Eastern Plaguelands as well or remove the Northrend Dalaran from the game? Thank you.", "author": "Moreidan"}
{"url": "/forums/en/wow/topic/20752628929", "title": "Important Question", "replies": "10", "first_post": "This is the worst attempt at communication I have ever seen from Blizzard before a patch, especially one with a raid involved. Why?? If you haven't touched the PTR, you probably have little to NO idea about what is going on with your spec yet to this point. All we have been told is more timewalking(YAY PANDAS), secondary stat squish, and Nighthold. Hell the video about the patch says to check the patch notes for more info. The notes aren't even out yet...Three days before it goes live. Good job on dropping the ball here guys.", "author": "Archaedan"}
{"url": "/forums/en/wow/topic/20752510772", "title": "Why is there no communication?", "replies": "1", "first_post": "Are we seriously going to get into nighthold and still not be able to interact with our weapons as casters? Even when running resto I can draw my MACE AND SHIELD one time in maybe five, and then they snap back into place and ignore any command to re-draw. This isen't going away blizzard. You can't just ignore this and hope the playerbase forgets. It annihilates that oh-so pwecious \"immersion\" you spent 2 years !@#$%ing at us about during wod", "author": "Krondax"}
{"url": "/forums/en/wow/topic/20752500489", "title": "Caster weapon animations when?", "replies": "1", "first_post": "Reforging.", "author": "Vazkai"}
{"url": "/forums/en/wow/topic/20752640275", "title": "Reforging", "replies": "9", "first_post": "smh blizzard what are you even doing", "author": "Bullandis"}
{"url": "/forums/en/wow/topic/20752510745", "title": "Premeditation > Enveloping Shadows", "replies": "6", "first_post": "Where are the blue sticky topics for each class to provide and review feedback? The most urgent and important issue right now is class balance and there are no topics posted by blues for each class. Instead we have topics for micro holidays and raids. It says a lot, that there is no discussion post issued by blues for each class. It says they don't care about class balance and don't want to discuss it. It's the white elephant in the room. Let's pretend class balance isn't the most important issue for this patch. It's really disappointing to come looking for info about my class and find nothing..", "author": "Ghostshoes"}
{"url": "/forums/en/wow/topic/20752589818", "title": "Blue Class Feedback Topics", "replies": "2", "first_post": "Hello, So a day or two ago Blizzard snuck a change to this spell into the PTR that completely changes the functionality of Serenity while also nerfing it. For those unaware, Serenity currently halves the CDs of our abilites when cast and halves the CD of any ability cast during it. For example, if Fists of Fury had a CD of 12 seconds when we activate Serenity, it would drop to a 6 second CD. If we used it during Serenity, instead of being a 24 second CD, it would be a 12 second CD. However, on the PTR, after Serenity ends, the second usage of Fists of Fury results in the CD bouncing back up to the normal amount, so it would be back to around 24 seconds. Not only is this an overall damage nerf, (less casts of FOF, SoWTL, etc), but it also harms the fluid nature of our rotation and makes the rotation overall less fun by reducing the number of big spells we get to cast. This forces us to do more filler ala Black out Kick, Tiger Palm, Flying Serpent Kick, which aren't particuarly enjoyable abilities due to their low damage. Here's an article on WTW about it in case I was mistaken in any of the above information: http://www.walkingthewind.com/2016/12/01/ptr-7-1-5-nov-30-part-3-serenity-changes/ My complaint about this change is not that it's a net dps nerf, but that it's a really unecessary, unfun nerf. There's nothing fun about having to do more filler spells. It also ruins the flow of the rotation, because as of now in a patchwork fight, we can basically use Serenity off cool down without holding anything for more than 5 seconds. With this change, our spells will not line up as well resulting in us having to hold one of our big spells or hold Serenity for a longer period of time. This change seems like a solution in search of a problem; Mr. Babs has suggested this change was made by Blizzard to \"unify\" CDR mechanics, but I fail to see the necessity of this. Serenity is a major cooldown and a max level talent, there is no reason for it to behave like other abilities. How it worked made it unique. If we want to be more uniform, wouldn't it be best to make it a 30% damage increase for 20 seconds like some other classes /s I realize that Blizzard does not care about how much players enjoy the game, and has stated repeatedly they make the game THEIR DEVELOPERS want to play, but this is not a change that will make Windwalker Monks more fun for anyone to play. I refuse to believe there's anywhere close to a majority of people who find hitting less big spells to be fun. Unfortunately due to Blizzard's lack of transparency, we have no idea why this change was made, so we can't give any feedback as to wether or not this meets their goals. All I can say is that I think this is an unnecessary change and the wrong way to nerf Serenity if Blizzard believes the main cooldown of a struggling spec needs to be nerfed. This change doesn't make the class more fun or engaging to play, and I believe that should be the litmus test for most changes as this is a video game. Thanks for reading my ramble and I hope Blizzard is either more transparent about the reason for this nerf or reverts this change and nerfs us in another way.", "author": "Azhurea"}
{"url": "/forums/en/wow/topic/20752278301", "title": "7.1.5 WW Monk Serenity Change", "replies": "39", "first_post": "Any chance for one in 7.1.5 or is looking like that will be 7.2?? I've already suggested the green flametalon mount as all the mount achieves are usually flying ones. Something new would be awesome too.", "author": "Bags"}
{"url": "/forums/en/wow/topic/20752535429", "title": "350 Mount Achievement??", "replies": "9", "first_post": "This is a serious question, because all I see are buffs in the patch notes, but complaints from everyone. So based on what is on the PTR, who is satisfied with the impending changes?", "author": "Vip"}
{"url": "/forums/en/wow/topic/20752609777", "title": "Class Changes - Who is happy?", "replies": "159", "first_post": "Soo was checking out what we can expect tuesday.. Spiritual Journey While Ghost Wolf is active, the remaining cooldown on Feral Spirits recovers 300% to 500% faster. Why keep uping the % of a travel form activated passive. No one wants to be in a form they cannot fight in even for such a minimal effect.", "author": "Frau"}
{"url": "/forums/en/wow/topic/20752550293", "title": "Spiritual Journey", "replies": "2", "first_post": "If it's possible: could we get a explanation/clarification as to why this change was made? It seems that over the years Charge has lost much of its initial cc components, going from stunning to rooting and a talented stun, which is now completely gone as per Live but re-surged as part of prot's Warbringer in the PTR. Talking specifically of Arms: Honestly I don't think this is a good change. I would admit having it stunning was and will always be just too much alongside the repertoire of stuns, but the root was just perfect. Removing the root hurts warriors severely in the pvp aspect of the game. And having a second slow is just flat-out redundant with Hamstring. Please if it's not too much to ask, could we get an explanation?", "author": "Pannacake"}
{"url": "/forums/en/wow/topic/20752208791", "title": "Warrior: Charge/Intercept Change", "replies": "10", "first_post": "So with the supposed 7.1.5 comet speeding toward WoW, killing everyone's character, destroying their stats, wrecking their lives, causing them to unsubscribe (thank god) I just want to throw my two cents in and say thanks for not messing with priests, especially disc priests. We remain the main pillar of the healing classes. All these people complaining about the lack of communication concerning this patch are using the very system they are complaining there is a lack of in the first place. Just because you and a group (no matter how large they are) ask for something doesn't mean you are going to get it. They don't NEED to address every gripe you have. Don't like it, speak with your wallet and actually unsubscribe, something everyone's been threatening since I started playing back in WotLK", "author": "Monkchip"}
{"url": "/forums/en/wow/topic/20752610338", "title": "7.1.5 Patch Changes", "replies": "11", "first_post": "Do you think that maybe you are doing something wrong, devs?", "author": "Divinespark"}
{"url": "/forums/en/wow/topic/20752517231", "title": "Guardian Displacer beast", "replies": "6", "first_post": "Hello, I would like to know the reason why guardian are losing displacer beast. Displacer beast is the go to talent for a lot of gardian. Mainly in mythic + and in raid where moving out of thing asap and often is important. I mean warior have heroic leap monl have roll, demon hunter have their jump paladin i think have their horse and dk can immune most of the stuff. Blizzard is removing displacer best and giving us a fear instead in a mobility talent row. Improved inc roar is interesting and i m sure it will have is niche but when i m taking displacer best i want to move out of stuff not move in and i dont want to be able to move out fast only 1 time every 2 min or so, So I would liek to know the resoning behind this unfair pruning. and please dont call it a class fantasy been able to shapeshift is part of been a druid", "author": "Leetah"}
{"url": "/forums/en/wow/topic/20752668058", "title": "Never seen such a universally reviled patch", "replies": "94", "first_post": "It is said that the goal of secondary and gear system change is to make item level more of an indicator of item strength. This is primarily because right now a 850 ring can be better than a 880 ring for example and it is hard to judge the strength of the item due to secondaries. Now is this game design direction applicable to trinkets? Namely, like Ion said, 15 ilvl is always going to be an upgrade, \"we want you just to put it on without worrying that it may be worse\".", "author": "Elenia"}
{"url": "/forums/en/wow/topic/20752500408", "title": "ilvl being more indicative for trinkets too?", "replies": "5", "first_post": "Whats Rogues top dps spec 7.1.5? just lvled a rogue, wondering which has highest dps in ptr?", "author": "Pigorhen"}
{"url": "/forums/en/wow/topic/20752669608", "title": "Rogue dps PVE specs best", "replies": "1", "first_post": "I really urge you folks to get on here and actually observe some of the concerns that we have for the next upcoming patch. There really needs to be a constant line open for communication when it comes to things like this. You have to remember, you're dealing with a community of people (myself included) who have been dedicated to this game for so many years. For you to in what we feel, gut, the classes and give them simple rotations, take away utility, make them completely dull, and then not listen to the player base when we tell you \"Hey, this isn't a good thing, it needs to be re-worked and this is why\" could make a strong argument that your customer retention could very well become at risk because of the one thing that we require, that you're not providing. Communication. Keep us up to date, listen to us. We're not just some low-IQ brainless losers who play on their dad's computer. I imagine that most of us who play this game understand it in many more concepts than you'll admit. When I read these comments from players with no blue post to respond to the concerns, it half-way tempts me to shoot an e-mail to Michael Morhaime and ask him what exactly is going on in that part of WoW. Just saying.", "author": "Leetdots"}
{"url": "/forums/en/wow/topic/20752675592", "title": "Developers", "replies": "11", "first_post": "Could someone please point me to the complete PTR patch notes? When I saw that the patch was coming out on Tuesday I wanted to look over the patch notes, but they seem to be separated by different themes (class, items, spells, etc.), and have many different versions. I found [url=http://www.mmo-champion.com/content/6118-Patch-7-1-5-PTR-Build-23038] this one[/url] on MMO champion back from mid November, but I thought I read about class changes that weren't there. Is that the best we have or is there a better, more up to date compilation out there? I have seen quite a bit about the lack of Dev feedback here so that might be why I can't find what I am looking for. The other reason could be I just am blind. Thanks for the help.", "author": "Invêrse"}
{"url": "/forums/en/wow/topic/20752489333", "title": "Where are the complete PTR patch notes?", "replies": "6", "first_post": "I thought there would be 4 specs to every class on legion release? Was this just a rumor going around or was it an actual thing that Blizzard scrapped?", "author": "Lelandrá"}
{"url": "/forums/en/wow/topic/20752469040", "title": "Back to 7.0", "replies": "2", "first_post": "- Rogue damage and health in PvP is horrible. - Rogue slows at 30% kills both PvP and Mythic+ kiting. - Assassination AoE is too low and too RNG (Bag of Tricks fishing). - Subtlety AoE is horrible. - Subtlety rotation is horrible, and Shadow Dance needs to change. - Subtlety Artifact traits break CC. - Roll the Bones has too much RNG in it (fishing for True Bearing). - Slice and Dice will not compete with Roll the Bones and Marked for Death (the talent you would have to drop). - Outlaw's Blurred Time is the worst golden trait in the game, taking 2 seconds off 3 minute cooldowns. - Rogues still have many mandatory talents, e.g Venomous Wounds for Assassination, Subterfuge for Subtlety. - Secondary stat weighting is messed up. Haste is useless for all specs. - Rogues lost too many abilities with the 'pruning'. - Free Pistol Shots should be off the GCD, to avoid energy issues.", "author": "Dalivastin"}
{"url": "/forums/en/wow/topic/20752546768", "title": "Here is your concise Rogue feedback, Blizzard", "replies": "31", "first_post": "Is anyone satisfied with the mechanics and structure of their spec as of 7.1.5? Maybe it has one or two minor flaws but overall its strong? Or maybe it's just universally considered terrible? I'm sure many other specs being nerfed/changed unfavourably would be interested to hear stronger options!", "author": "Elenia"}
{"url": "/forums/en/wow/topic/20752439755", "title": "Spec Satisfaction?", "replies": "13", "first_post": "I'm trying to understand why Grimoire of Sacrifice is being nerfed. Currently 63.3% of people use Supremacy, 23.12% use Service and just 13.58% use Sacrifice, its a pretty considerable dps loss as it is yet its getting nerfed from 100% spellpower down to 75%. 25% nerf to something that's already under-performing/underrepresented? Am i missing something here and this is just a tool tip update and nothing is really changing or?", "author": "Zanzaaka"}
{"url": "/forums/en/wow/topic/20752629511", "title": "Grimoire of Sacrifice nerf.", "replies": "8", "first_post": "what the end of world of warcraft and the patch notes have in common......? they are both coming soon... hahahahahahahahaha", "author": "Virus"}
{"url": "/forums/en/wow/topic/20752529126", "title": "coming soon....", "replies": "9", "first_post": "I started playing Legion within a couple days of it's launch. Between then and about two weeks ago I had attained one legendary item. Since I unsubbed 2 weeks ago, I have received 3 legendaries. Is this intentional? Does legendary drop chance increase if you unsub? Also, I've only done maybe 10 heroic dungeons and one mythic since I unsubbed. Not like I've been playing a lot.", "author": "Lexthyra"}
{"url": "/forums/en/wow/topic/20752429639", "title": "Unsubbing and legendaries", "replies": "2", "first_post": "Sure seems like there is alot of negativity regarding just about every aspect of the game for this patch including the lack of dev feedback. A few of us know the distaster that overhauling and lack of communication did to SWG. Will WoW suffer the same fate? What can Blizzard do to prevent the same outcome that happened to SWG?", "author": "Horsdoeuvre"}
{"url": "/forums/en/wow/topic/20752468787", "title": "Is 7.1.5 The Star Wars Galaxies Patch?", "replies": "40", "first_post": "\"With the way these items are in 7.1, if we add such a system, everyone will just pick the best 2 for their spec and the rest will still suck. We'd rather that none of them sucked.\" - Lore I can't find the simulation math at the moment, but I believe on live the elemental legendary boots are something like 4% DPS increase on sustained fights. Their proc rate on PTR was just cut in half. On top of this, basically every talent tier has been shuffled around for elemental (hello Legion Beta!), and the dominant spec now spends a lot of maelstrom on frost shock, further reducing the effectiveness of the boots. The legendary boots might be something like a 1% DPS increase now over an identical 910 stat stick, (can't do any testing since character copy is disabled). How does that not \"suck\" for a legendary? edit: removed some hostility from my post, but not my soul", "author": "Tankform"}
{"url": "/forums/en/wow/topic/20752516329", "title": "Deceiver's Blood Pact", "replies": "18", "first_post": "Source: http://www.mmo-champion.com/content/6085-BlizzCon-2016-World-of-Warcraft-Legion-What-s-Next \"The team looked at all of the talent rows, there are some talents that are never worth considering. These talents may need tuning or redesign. The talents that 98% of players are taking may just need to be baked into the spec.\" Plenty of specs across all the classes, including most of the ones I play for Druid, still have this problem. Stellar Drift MIGHT be taken for AoE, but the other useless talents will still never be taken. My talents WILL NOT CHANGE because nothing got baked in or anything. \"This patch will also allow the team to look at secondary stats to make them a little more balanced, so that anything but one specific stat isn't useless. If an item has a higher item level, it should usually be an upgrade rather than having secondary stats make it a downgrade.\" With the exception of giving Boomkins a slight Mastery scaling bump, IIRC, that was the only outlier across classes. How were secondary stats actually \"balanced\" besides just nerfing them? \"The team is also going to try to improve the feel of the classes and add some utility to classes that had a little bit much pruning.\" So just Shroud of Concealment for Rogues and traps for non-Survival Hunters then? Oh and they nerfed Boomkin's only utility of giving a nice Haste buff to healers. Also for the most part, a lot of specs/classes are feeling worse off, so how is that improving, exactly? I also remember seeing something about trait adjustments, but I can't find the source on that. That said, Boomkin probably has the most lackluster traits in the entire game, especially it's laughably bad golden trait, \"Echoing Stars\", that's weaker than pretty much any of our minor traits outside of extra armor or a minor heal every 30s when we're attacked.", "author": "Jaywaves"}
{"url": "/forums/en/wow/topic/20752589536", "title": "Blizzard flat out lied about 7.1.5.", "replies": "71", "first_post": "Change them to purple, reduce the stats, keep the bonuses, make them drop off of specific raid bosses or M10+ chests or hell, even rare WQs that spawn once a month or something. Something that we can farm for instead of crossing our fingers and praying they drop. Give us real legendary items we have to earn or just remove them completely. It's unanimous that the system is broken and completely altering gameplay balance. They're just lame random orange items that can drop from cracking nuts and catching squirrels. Give me a break.", "author": "Frozenclaws"}
{"url": "/forums/en/wow/topic/20752348061", "title": "Fire Mage Changes 7.1.5 Build 2", "replies": "4", "first_post": "I started playing in Wrath but I took up Fire Mage only in Legion having not played it since I last tried it in Wrath. I liked it. It was fast, controllable (For the most part), and had its rewarding moments if you knew what you were doing. In comes Patch 7.1.5 on the tail of a very successful Blizzcon for WoW after Ion promised us so much content and exciting changes for all classes that made sense while he talked about them. But we got this abomination of a patch that looks to ruin Legion by going back on some of the promises that were made by Blizzard, particularly not making players regret their choice for playing a spec, playing a certain class and above all purchasing the game. As it is, Hunters, Warlocks and Demon Hunters are just flabbergasted at what has happened to their class. I don't blame them. But people have this misconception that Blizzard cares only about Mages because we got some reskins of a single spell, some changes that make no sense. People, Mages aren't any more favored than Warlocks or Hunters because we are getting looked at. It is BECAUSE we are being looked at that terrifies me. Mages might very well be joining the Hunters and Warlocks soon enough. I have only played Fire mage, Disc Priest, Prot/Fury Warrior this expac and I main a Fire Mage. So I cannot speak for Hunters or Warlocks but I can try to show you how much beating we have taken. Major Changes and How it affects the spec: 1. Critical mass(Multiplied Crit chance; passive), Molten Armor(20% Increased crit and damage reduction; passive) and Ice Barrier(a pretty okay shield; active) have all been combined and split into two abilities. Critical Mass(10% flat crit increase with additional flat increase from stats; passive) and Blazing Barrier(Orange garbage shield; active). Effect: While nobody really cares much about the visually updated Blazing Barrier its Critical Mass here that bothers everyone. Because of how much secondary stats have been nerfed in addition to Baseline Crit, our ability to get Hot Streak has become slightly not possible. In effect, we need more crit. 2. Removal of Ice Floes Effect: In addition to the damage nerf of Legendary bracers means, No more fancy casting while moving. We are just another cloth turret who will lose DPS even if they move so much as an inch. We cannot be different from other casters anymore. We just have different visuals. This change Hurts a LOT. 3. Combustion's Mastery and Rune of Power Nerfs. Effect: Combustion has always been a Fire mage's shining moment. particularly in this expac (It's the 7th iteration of this spell. or is it 8 now?). Because of the nature of Ability Synchronisation, Fire is a good burst spec. it's no Shadow Priest but it's okay. This is also the Point I'm most salty about Ion going back on his promise. We were told that other abilities will be beefed up to compete with the Mandatory ability. but what we got was a nerf to the Ability and still better than the others. So no More intense burst phases. 4. Addition of New Legendaries and Scorch. Effect: Scorch is the ONLY ability that you can cast while moving and its garbage. Because the pool of Legendaries are diluted so much and Combustion being only 75% Effective (on its own. combined with other nerfs its only about 48-51% effective in PTR when compared to live), the New Legendary Gloves is MANDATORY and it is going to be hard to obtain. You can't do as much DPS as LIVE in 7.1.5 or Nighthold without it. Overall Effect: Because of all these Nerfs, Right now a good Fire Mage can lose anywhere from 70-100k DPS. No more covering some simple raid mistakes like missed Tentacle soak on Helya. Legendary Bracers are now worser than Prydaz. from BiS to WiS. and no more shining moment. an 850 Item with Crit is now worth way more than 885 with no crit. Why are we playing Fire Mage again? Why are we playing Mages again? Why are we playing Legion again? Proposed Solution: The Simplest Solution is to just revert back the changes to 7.1 and just tweak the numbers. Address only the Specs of certain classes that need slight changes. like Outlaw Rogues and their Roll the Dice (I know its bones but it is RNG). This will be the best choice for most of the specs, like Hunters and Mages. If you wanted to keep the changes, Give us back icefloes, buff ROP and the entire row. not nerf them. and Also. leave Critical Mass and Molten Armor as they are. the overall Secondary stat nerf will be enough to nerf the damage along with Combustion nerf and inability to control Fire Blast. Please Blizzard. Legion has been the best expansion so far. listen to your player base. Don't turn this dream expac into a Nightmare.", "author": "Brisîngr"}
{"url": "/forums/en/wow/topic/20752650022", "title": "NERF BOOMYS DOTS!", "replies": "8", "first_post": "please nerf boomys dot dps its a joke they don't even have to cast 1 thing", "author": "Evilwardlock"}
{"url": "/forums/en/wow/topic/20752670064", "title": "Disable hunter CC traps in pvp", "replies": "29", "first_post": "If there's one class that doesn't need more ways to kite & cc people it's probably hunters. It's fine if they get their traps back for pve, but really -- marksman and especially beastmaster don't need them in PvP. I honestly don't want the WoD plague of hunter + priest + druid back. (Where all they did was spam-cc healer for up to 40 seconds because trap doesn't DR with fear, cyclone, root, sheep, stun or silence).", "author": "Lina"}
{"url": "/forums/en/wow/topic/20752630202", "title": "Prydaz only 15% for tanks?", "replies": "1", "first_post": "Prydaz, Xavaric's Magnum Opus provides 15% shield for tanks and 25% for dps or healers? Is this intended? Mine gives me 25% shield on my druid if I am in Resto, Cat, or boom, and gives me only 15% if I am in Guardian as of 7.1.5. I saw another Paladin Tank yesterday and his was 15% as well as of 7.1.5. Thx, Cank", "author": "Lecank"}
{"url": "/forums/en/wow/topic/20752599709", "title": "WW Monk", "replies": "1", "first_post": "Please buff more. If there is a 25-31% difference in dps thats insane. More WW will agree, and ill let them do all the technical talk and comments as im @65% percentile. Better off letting the pros who know. but for real the pros are even showing that were the worst dps spec.", "author": "Senshenzu"}
{"url": "/forums/en/wow/topic/20752590288", "title": "Rank 1 and still 200k+ behind others?", "replies": "11", "first_post": "https://www.warcraftlogs.com/rankings/12#boss=1962&class=Hunter still at least 200k behind rets and rogues and many other specs , amazing balance job here TIME to reoll.", "author": "Vexea"}
{"url": "/forums/en/wow/topic/20752660492", "title": "WE NEED FREEZING ARROW", "replies": "5", "first_post": "MM HUNTER NEEDS FREEZING ARROW FOR PVP CHASING A HEALER AROUND TO TRY TO BURSTING SHOT INTO A FREEZE TRAP IS RETARDED IM RANGE GIVE ME A RANGE CC", "author": "Serval"}
{"url": "/forums/en/wow/topic/20752506278", "title": "[Feedback] Balance Druid in 7.1.5", "replies": "264", "first_post": "Crossposting <Serenity> Nagura's post from EU forums to get more exposure on some Balance Druid issues in 7.1.5. Original post here: https://eu.battle.net/forums/en/wow/topic/17614632256#1 ...", "author": "Gapezilla"}
{"url": "/forums/en/wow/topic/20752547229", "title": "Prydaz nerfed back down to 15% (for tanks)", "replies": "76", "first_post": "Just got on the PTR and it appears that Prydaz, Xavaric's Magnum Opus was nerfed all the way back down to 15% of maximum health on the absorb shield after being buffed to 30% and then being nerfed to 25%. Does anyone know if this is intentional? EDIT: It has been pointed out to me that it is 15% in tank spec and 25% in dps spec.", "author": "Halstinavos"}
{"url": "/forums/en/wow/topic/20752650038", "title": "WTF did you guys do to Affliction?", "replies": "6", "first_post": "Let me start by saying I actually rather liked Affliction in this expansion because it felt a lot more like classic affliction and not the convoluted mess of MoP/WoD that required a bunch of silly debuffs to make dots effective. Now I know I'm late to the party, but the patch notes seem to forcing us into a complete 180: Drain Soul is now baseline, and it now heals for half as much. (200% vs 400% on live) Where is Affliction's iconic Drain Life ability? Malefic Grasp is back as a talent that makes your dots do 80% more damage while you're channeling your filler. Haunt increases your dot damage for 15 seconds with a 30 second cooldown. I'll admit the version on live doesn't really seem to be ideal over the other 2 talents in that tier because Drain Soul and Haunt tried to do the same thing (deal extra damage) and Drain Soul did it better. However, now they're both trying to do the same thing again (boost dot damage this time) so...again, only one will be optimal over the other. Seed of Corruption now costs a Soul Shard baseline. Just...why? Is being able to mass-spread corruption (a huge QoL effect) and have some form of reliable AoE really that overpowred? Maybe I'm just griping, and i'm okay with this being nothing more than that, but it seems like in one single patch, we're going from having a really solid spec to having more of the same gimmick-bloated crap we had during WoD. Only this time, we're still stuck using the damned Felhunter because somebody thought that being able to actually choose pets was too fun. Or something. My biggest regret for this expansion now is not playing my Affliction Warlock more, because now all of its fun toys are being taken away. Affliction in 7.1.5? RETURN TO SENDER!", "author": "Aesica"}
{"url": "/forums/en/wow/topic/20752516041", "title": "Prydaz, Xavaric's Magnum Opus - Spell Effect", "replies": "12", "first_post": "Please remove the bubble spell effect graphic from the Prydaz, Xavaric's Magnum Opus necklace. It distracts from the look of a character with everyone that has one encased in a large sphere. There is no option to transmog it into another look since its a necklace; and with it being a legendary item, removing it really isn't an option. In addition, when mounted, it sits halfway up on your character model intersecting their waist which gives the appear of a light bulb. Very disappointing. Thank you for removing the sound effect for it activating! However, please reconsider the large bubble effect as it negatively impacts our ability to select the appearance of our characters. There are already many people running around Dalaran on the PTR encased in these bubbles since its available to any class. Please remove it to retain the individual looks we work so hard to obtain. Thank you!", "author": "Thraxx"}
{"url": "/forums/en/wow/topic/20752548275", "title": "Top tanks in 7.1.5?", "replies": "37", "first_post": "Which tank do you think would be the top 3 in the new patch? For say M+/heroic/Mythic raids.", "author": "Ümx"}
{"url": "/forums/en/wow/topic/20752599826", "title": "mm suggestion", "replies": "2", "first_post": "I think MM would be a be a bit smoother like this... 1. delete marked shot 2. Marking targets now causes youe next arcane shot or multishot to apply vulnerable and do bonus damage Also delete patient sniper and replace it with something better", "author": "Bandet"}
{"url": "/forums/en/wow/topic/20752650173", "title": "Enhancement Legendary Concerns", "replies": "2", "first_post": "Hello! I didn't see any recent posts about this and wanted to offer some feedback on enhancements choice in legendaries, and feel free to tell me I'm wrong my fellow shaman. I feel like legendaries for us are pretty unremarkable, besides eye of the twisting nether and as of yesterday uncertain reminder, all the rest of these barely offer any sort of aid to our rotations. I currently have an opus and Akainu's bracers, and with the last minute changes to the bracers from 50% dmg to 30% in the PTR and hailstorm's nerf really did make them useless. I will say I'm very happy to see people having varied lvl 15 talents and not just being boulderfist locked anymore, but if you want enhancements to make their RNG dps even more RNG with hot hand, and they have these bracers, let them see some results from them. If any other shaman have other leggys that they feel like since 7.1.5 are pretty unconsequential, feel free to post here. I only have my 2 leggys I've played with for a long period of time, so I can't say I'm an expert of all of them. Thanks!", "author": "Tolkh"}
{"url": "/forums/en/wow/topic/20752629567", "title": "Legendaries", "replies": "1", "first_post": "Like most of you know, the wow token will probably be used to purchase in-game services in the upcoming patch. This, of course, is great news for everyone; I have a question though. Will there be a separate token for each in-game service, or will the token be valued at a certain price ($15.00-$20.00?). Or will the same token we have now have multiple uses. What I'm getting at here is just a confirmation for those looking to buy tokens now, or if a separate currency is coming with the patch that will be used to buy these services. As it stands, the token has been rapidly increasing in price this past week or so. Feel free to discuss predictions here as well, thanks", "author": "Waylis"}
{"url": "/forums/en/wow/topic/20752255893", "title": "WoW Token in 7.1.5 Confirmation Request", "replies": "11", "first_post": "A blue apparently sent an email asking devs for an update on MW Monks as seen here https://us.battle.net/forums/en/wow/topic/20752675155#post-16 So I'm wondering as I'm sure the rest of the MW Monks are, what happened to the response? After all the feedback the MW population has given, we've had nothing but radio silence all this time and to throw us a bone with no delivery is not cool. I'm hoping we get that update and that this doesn't fall on deaf ears", "author": "Teradan"}
{"url": "/forums/en/wow/topic/20752659654", "title": "MW Monk Email?", "replies": "7", "first_post": "Hey guys, I've heard Blizzard is stepping up their communication game so I thought I would go ahead and share some of my thoughts on frost mage and the direction the class is going. Here are my logs, I don't suck and have extensive time playing multiple variations of frost at a high level this expansion: https://www.warcraftlogs.com/rankings/character/15984586/10/ First of all, there are many good things I like about frost. I will not be talking about these things. I want to address problems and concerns in a concise and easy to read manner, however I do still love frost, and will continue playing frost over arcane and fire...I am a frost mage. So, lets begin. Single Target DPS Frost single target in a vacuum is fine, more than fine really, you can see we actually sim tops of the charts for patchwerk style 880 gear. However, if you take a look at Guarm Mythic, a patchwerk style fight, you will see it is not frost mages at the top in reality. https://www.warcraftlogs.com/rankings/12#boss=1962 Now frost is not far behind, you would only have to go to page 2 to find Razlopper playing Glacial Spike followed closely by a Ray of Frost build and Bonechilling. You may say, well hold up, how is it simmed at the top if 3 guys are playing 3 different specs? What are they simming for? Well, the answer is Bone Chilling, Incanter's Flow, and Thermal Void. This is the spec beating everything in sims, but in reality it doesn't always work out that way. Now don't get me wrong, I myself have had some amazing pulls on fights running this exact build, but it has flaws. - It is incredibly punishing if there is a break in the action, such as a phase change or too much movement where you run out of ice flows or have a gap in DPS due to changing sides of a room. - It is very inconsistent. This spec sims around 100% uptime for icy veins and assuming you are dumping all of your ice lances into 3x chain reaction. If you get unlucky, this just doesn't happen, and can sometimes be left with a minute and a half of hitting like a wet noodle while you wait for icy veins to come back up. - It relies on the legendary gloves. 1 FoF proc per 10 is really nice to have, and the above problem of consistency can probably be solved by the gloves. I don't know for sure, I don't have them. Which sucks. - This build has absolutely no burst. Don't get me wrong, I love Bone Chilling Thermal Void, it is like juggling while treading water, trying to maintain chain reaction and icy veins...but missing burst damage is definitely a problem with this build. So what about Glacial Spike and Ray of Frost? Ray of Frost and Glacial Spike are both fun builds. Ray of Frost is very bursty on the opener, making it a valuable choice, and less risky option. I have found this spec to be far more consistent than Bone Chilling, I mean how can you screw up popping hero + rune of power + icy veins and then go grab a drink while you channel a 10 second cast. Once you are done with the channel, it is ok if you let icy veins fall. You no longer are forced to maintain it indefinitely, the goal is really just to push icy veins forward 60 seconds to get another Ray of Frost in it. This is easier to do, and if you mess it up it isn't that big of a deal, you get most of your damage from the first Ray of Frost anyways. Glacial Spike is interesting too, as the spec tries to take advantage of shattering as many frostbolts as possible, and gaining value on splitting ice when possible. Another spec where you have a relatively consistent burst rotation, followed by downtime. Alright, so what am I getting at, and what does this have to do with the PTR? Alright, so frost is in a magical spot right now where we actually have meaningful choices and options in our talents. This is absolutely amazing, but with the sweeping changes coming in 7.1.5, it is inevitable that the balance gets tipped one way or another and a dominant \"right\" choice emerges. I don't want this, please keep Ray of Frost and Glacial Spike as meaningful options. Also, Bone Chilling Thermal Void has absolutely the most weaknesses right now in terms of single target, with it being the most punishing and least bursty. Right now the spec plays like a spriest, but if you let icy veins fall off, rather than die, you just do crap DPS until icy veins comes back up again. I am not sure how to fix this problem, or if it even needs to be fixed, but it can be frustrating at times. I hope when the numbers get crunched on the PTR all 3 iterations of frost single target end up in a similar state.", "author": "Hellayna"}
{"url": "/forums/en/wow/topic/20752496682", "title": "7.1.5 Frost Mage Feedback and Concerns", "replies": "76", "first_post": "Okay lets all take a break and have some fun. I propose a game. Post a complaint you have about your class, and the next poster posts what he thinks the devs might do to solve said problem (in typical, hillariously incompetent dev fashion) For example: Problem: Mirror image still underperforming compared to rune of power. Dev solution: Change mage 2 piece set bonus on all specs to increase rune of power by 5%, but also changes your level 45 talent choice to mirror image. The devs would then see a huge increase in mirror image usage and declare this a success. Okaynow for real, I will pose the first issue. Problem: Frost mage aoe is far too low to be in line with the expectations of a dps class. We dont mind being worst, but the margin is too large.", "author": "Ðmoney"}
{"url": "/forums/en/wow/topic/20752558331", "title": "Fun with Dev solutions", "replies": "225", "first_post": "(Written assuming the Devs have taken some kind of contrarian oath never to do the obvious, popular, prudent or common sense thing; I'd like to thank the Devs for the following): Thanks Devs for ignoring or discounting anything anyone anywhere has ever said that could be construed as criticism of your own personal class and spec vision. You do you Devs! Thanks Devs for nerfing, as an Arms warrior, my talents, my artifact, my relics, my talents again, my pvp talents, my useful legendaries; and my T19 set bonuses -before I even got to use them. Great job! Thanks for attacking the Protection spec; probably the most complete, enjoyed, and useful Warrior spec, by removing all the engaging talents and adding bastardized DH talents as filler. That'll learn 'em! Oh, and thanks for nerfing Shockwave (again), a mean a *4* second stun on a 20 or 40 second cooldown? Way OP. Its not like its already the only aoe stun in the game that punishes players for using it for single target as well is it? Good change. Thanks Devs, for completely ignoring all the problems with Fury, and the literal hundreds of posts asking for them to be addressed, from its low single target damage, its lack of personal defensive cooldowns, its near pointless self-healing, the unholy mess that is rampage, the list goes on and on! Good thing none of that got changed, I was especially worried after you came out and said specifically that it would to! Good u-turn Devs! Well done And by the way, thanks for making crit the highest stat on all three of the warrior artifacts, even though its the least desirable stat for every spec! You even gave us 8% crit on the normal T19 set pieces! What an embarrassment of riches! Whatever will we do with all this crit? Such indulgence Devs! I'd like to invite other players to share, in this still the festive season, what they're thankful for from the Devs as well.", "author": "Auset"}
{"url": "/forums/en/wow/topic/20752629507", "title": "A Thank You to the Devs from a Warrior", "replies": "7", "first_post": "I can't seem to find the character copy button, is it no longer available?", "author": "Sullâ"}
{"url": "/forums/en/wow/topic/20752429581", "title": "Is the PTR over?", "replies": "3", "first_post": "Can you not please? Diablo and WoW are both different games, different genres. Please stray away from this awful vision. Stop destroying WoW with all these Diablo ideas. Please come up with something original. If I want to farm greater rifts, legendaries, or play hack and slash mini-spec classes like the Diablo Crusader (ret pallies), Witch Doctor (BM hunters), etc. I'd just go play go D3. You also have to realize that Diablo 3 isn't an MMORPG. Get rid of the legendary system or at least make the legendaries optional and not a requirement. Revert some of the classes back to how they were in WoD or MoP. No one likes RNG in their rotations unless it feels rewarding. You're punishing us with specs that rely on RNG to be effective (rogues and MM hunters in particular). I mean you gave it a shot and it's not working in WoW. This PTR session should have advised you as to what your players want. I already unsubbed once last year (after Legion) and I only resubbed again recently last week to give it another shot. Still waiting on my !@#$ty incorrect second legendary to drop so I can quit. I don't even feel like logging on because of how frustrating the game is.", "author": "Itsnotogre"}
{"url": "/forums/en/wow/topic/20752658629", "title": "Fix legendary Upgrade Quest line.", "replies": "31", "first_post": "http://www.mmo-champion.com/threads/2141137-Legendary-Upgrades-Apparently-Gated-behind-Illidan-Quest-line TLDR - people on PTR recently discovered the legendary upgrade item is gated behind the illidan storyline quests, which on PTR still has an 8 week time-gate of collecting 80 souls w/ a 10 per week cap. i have no clue how to even start this or get to the point but i have not done it because i do not ever do lore chains and worthless quests.. this should not be a requirement to upgrade a legendary, plz fix this!!!!!!!", "author": "Vexea"}
{"url": "/forums/en/wow/topic/20752386323", "title": "7.1.5 Prot Warrior Feedback", "replies": "233", "first_post": "I spent some time on the PTR to try to test the changes to the prot warrior, but it is difficult to provide accurate feedback as there has been no communication as to why you changed what you changed. For other classes, it might be a bit self-evident. There have already been posts about how STM is difficult to balance and is an outlier in current talents and how Combustion/Rune of Power leads to fire mages being amazing when they are up and mediocre when they are not. But there have not been any posts detailing the failings of the prot warrior mechanics which would have compelled you to make the drastic changes that you did. All we have to go on are the following two bits from Blizzcon. You want to adjust stat priorities to make it so that high ilvl is almost always an upgrade You want to re-evaluate talents that everyone takes and possibly make them baseline Regarding stat priorities, Prot warriors are probably one of the most balanced specs in the game. You aren't going to ever convince all tanks to always take the highest ilvl piece as different tanks have different priorities. Some tanks haste/mastery so that they have the greatest overall damage mitigation. Some tanks stack versatility in order to mitigate all damage, even the spell damage. Some tanks just favor ilvl and stamina in order to prevent getting killed before healers can react. Some tanks just favor outputting the most damage possible, relying on the basic kit in order to obtain a level of mitigation sufficient for content. None of those tanks are wrong, and they all have different stat priorities. Yes, there is a general trend of favoring pieces without crit, but this is due largely to battle cry devaluing crit for 8% of the fight and the heavy diminishing returns on parry. However, even with those downsides some tanks will take the ilvl upgrade due to the increased damage from more stats + more strength and/or the increased stamina combined with the extra free rage from ultimatum. Now, about the talent changes... Devastator is a good idea but is in the wrong row. It is competing with Never Surrender and Indomitable, two talents that are 99% survivability focused. Having a rotation altering talent compete with dedicated survivability talents is a recipe for disaster when it comes to balancing. Devastator should be where Ultimatum currently is. Then you can balance Devastator to be a DPS increase as it is competing with two other pure DPS talents. Now the player has 3 different ways of increasing their damage, one of which allows them to play a non-GCD locked spec. I would even suggest adding rage generation to thunderclap (in addition to reverting the Focused Rage and Revenge changes) so that the Devastator build uses Revenge, Thunder Clap and Shield Slam while the non-Devastator build uses just Devastate, Revenge and Shield Slam. Since the non-Devastator build doesn't use Thunder Clap in it's single target rotation, you can use Thunder Clap as a tuning knob to balance Devastator. This is assuming that Devastator will no longer generate 5 rage per auto if moved to Ultimatum's spot as that would be a very large survivability increase on a DPS tier. As for the current location of Devastator, I would replace it with another pure survivability option. Since the other two talents deal with Ignore Pain, I would continue that pattern. An idea would be a talent that gives us a minor stagger type effect except instead of cleansing the stagger, the dot is minimized or ignored while the Ignore Pain buff is up. Something like \"Pain Tolerance\" 10% of all damage taken is converted into a dot called 'Pain' which lasts for x seconds, damage from Pain absorbed by Ignore Pain is reduced by 75%. This would be another semi-passive survivability talent which can compete with the 25% extra health from Indomitable by reducing the damage taken immediately and has some built in class flavor.", "author": "Kikwar"}
{"url": "/forums/en/wow/topic/20752660305", "title": "Disconnects", "replies": "3", "first_post": "Non stop Disconnects since patch", "author": "Hardshield"}
{"url": "/forums/en/wow/topic/20752540980", "title": "DEMON HUNTERS WTF", "replies": "6", "first_post": "Could they please do something to demon hunters I mean this is ridiculous they do so much damage so fast that its near impossible to stay alive even with a healer. Are they ever gonna fix this or just let it keep destroying pvp like the level 35 traits. Nobody has time to have that many toons that high.", "author": "Xamplw"}
{"url": "/forums/en/wow/topic/20752440486", "title": "To All The Demon Hunters", "replies": "8", "first_post": "If you are on these forums, and you are complaining about any type of nerf, or a change in your meta, whatever the case may be, un-sub, take your soccer helmet off, wipe the drool from your shoulder, and smack yourself you vegetable.", "author": "Ludfoe"}
{"url": "/forums/en/wow/topic/20752640385", "title": "Legendary bad luck protection", "replies": "15", "first_post": "How long does this thing take to kick in?? I got the tanking ring early in legion when I was specced tank. Even tho I dps way more. I've had my loot specialty set to Havoc ever since but I haven't seen any drops even tho I do my world quests almost daily.", "author": "Wardlaw"}
{"url": "/forums/en/wow/topic/20752599785", "title": "Prydus drop rate bugged?", "replies": "1", "first_post": "At least 5 people in my guild got prydus drop as soon as 7.15 droped, is this a bug? I mean why does the worst freaking item has the highest chance to drop.", "author": "Zama"}
{"url": "/forums/en/wow/topic/20752430042", "title": "7.1.5 prot warrior", "replies": "6", "first_post": "54 artifact trait , 2/3 mythic ToV... i played this guy quite a bit. The heavy repercussions nerf made it even harder to keep shield block up... or in other word, warrior now have to stack haste even harder to keep it up. That nerf also means it's even more important to fish for SS procs via devastate, leaving no time to use revenge on any single target fight, which means no vengeance proc, which means overall less ignore pains This wouldn't be an issue if Ignore pain actually scaled properly... but while popping some 800k ignore pain on heroic nythendra was overpowered, popping 1 million IP on mythic guarm who hit for nearly 2 million on his auto-attack is kinda laughable ; if I have to spend half of my ressource bar for this devensive cooldown, can it ATLEAST absorb one full autoatack? Also, while the old ultimatum/vengeance combo synergized with battle cry/shatter the bones, the current vengeance talent just feel punishing to use without devastator (there's no way to fit revenge in a ST rotation)... However, devastator itself feel punishing to use; loosing 25% hp/ 25% IP just so I don't have to spam devastate? heck, my prot artifact have a 2.6 sec delay while devastate only have a 1.5 sec GCD (pre-haste)...devastator don't even seems to increase the amount of procs I get! To top it off, loosing focused rage actually means a large-ish ST DPS drop, for tanks that cared about ST DPS... and the new revenge don't really help with AoE threat since it's incredibly huge rage cost means we can't use it outside of a proc. This is the second time since release that prot warrior have recieved the nerf bat in the face... did we deserve it that badly? we arn't druid running around with 75% armor reduction (heck, our shield block don't even work for odyn warforged spear/guarm flashing fang), we arn't paladin out-dps'ing regular DPS classes... Can we please get some explanation in the warrior forums?", "author": "Vlerg"}
{"url": "/forums/en/wow/topic/20752510872", "title": "7.1.5 Arms Warrior", "replies": "4", "first_post": "The PvP Changes are looking very nice. Very excited about those. What I like most about them is the diversity in format/play you're making available to them. Bravo to that and bravo to giving back Disarm to warriors and replacing a junk skill when doing so. Very nice. The PvE changes seem to be... missing. No I see them, but guys that doesn't look like anything there. That's token buffs, not an actual fix to the current PvE situation. Look, you like alternative viability in builds and you want to make secondary stats have value. Fine. Ok. Here: Rend ->(replaced with)-> Deep Wounds Your critical strikes cause the target to bleed for 20% of the damage done over 6 seconds. This effect is cancelled if the target reaches full health. There you go. You know, that skill that's been part of Warrior's arsenal since 1.0. Now Arms that go the Trauma/Opportunity Strikes path, have a full supportive system in play that puts them on a viability level of Focused Rage builds. - Oh, and look at that, a reason for Crit as Arms instead of stacking haste like Fury. - Oh, that even pairs nicely with how PvP Arms Warriors gear. Arms warriors won't need two sets of gear anymore. - Don't even need a legendary to be effective. Stop overthinking the problem. The solutions been there the whole time. -=-=-=-=- Second Wind has not been touched and needs to be. Outside of leveling/questing, this skill is useless. That's not an opinion, guys it's a fact. You have to wait 5 seconds of not taking dmg. That doesn't mean 5 seconds since the last time something was cast on you or hit you, it means 5 seconds after that DOT finally stopped ticking on you. See? Think about how long dots are up on a Warrior from another Player. Think about how often aoe hits a warrior in Raids. It's useless. Obviously you can't just give arms Impending Victory or it's kinda like giving them a nerfed Blood Thirst, and you can't change Thrill of Victory for the same reason. So revert it to the form it was in WoD (Whenever you are below 35% health, you gain 25% Leech, healing yourself for a percentage of damage you deal.). Look, you made a lot of classes now have auto-abilities that kick in at the 30% range, but you took away warriors. Well revert this one back. If it was too OP, tweak the values some to make it comparable. I dunno. Maybe make it 30% health and give +15% Leech to what the player currently has (additive not multiplicative). Would make Versatility be more desireable. -=-=-=-=- Fervor of Battle - why not have it buff cleave as well?", "author": "Deathpony"}
{"url": "/forums/en/wow/topic/20752440484", "title": "sorry for asking", "replies": "7", "first_post": "but does anyone know if they're gonna add back character copy? and if they are when?", "author": "Idiotgodx"}
{"url": "/forums/en/wow/topic/20752511182", "title": "Prydaz Soap Bubble graphic", "replies": "2", "first_post": "Is there anyway to remove the giant soap bubble graphic from my character? I thought the last one was bad, my god.", "author": "Aggrovation"}
{"url": "/forums/en/wow/topic/20752670083", "title": "Demon Speed nerfed significantly", "replies": "2", "first_post": "Demon speed used to be a godsend among Demon Hunters on the artifact tree. Original: Blur generates 2 charges of Fel Rush. http://www.wowhead.com/spell=201469/demon-speed 7.1.5 Change: Blur now grants a 30% movement speed RIP op artifact talent. o7", "author": "Byfelbepurge"}
{"url": "/forums/en/wow/topic/20752519644", "title": "To whoever behind 7.1.5 Rogue designs", "replies": "14", "first_post": "Congratulations on making a change that 99 out of 99 rogues don't like. It is not such a small feat to get this amount of disgust from community, it needs superb concentration and extremely retarded ideas to make a class totally unplayable. By your concept, I think you might want to nerf our agility and buff our strength because rogues are so OP in both pvp and pve that while dueling Draenei DKs, their bodies turn green by taking so much of Deadly Poison. Most DHs confessed they can see hell even with their eyes popped out while facing a rogue. I understand how we have very little stamina because we are very swift ninjas with a lot of disabling abilities so if you want to escape from these SWIFT DEADLY NINJAS, you have to press W as hard as you can since Crippling Poison only slows you by 30% and your slows take 50% speed from these SWIFT DEADLY NINJAS. Feint energy cost is almost doubled because some players have that OP Legendary Pants that heals whenever Feint, a spell which every player has, is used? Yes of course feint has to be nerfed because the pant heals a lot. And we still have more of these talents that nobody considers taking such as 'Death From Above'. I think you might want to nerf other talents in that row to make DFA worth taking. I'm just joking, after 7.1.5 goes live, you guys will always be remembered, as the worst and most retarded batch of Devs ever. I've never seen such horrible feedback from the community and you guys still choose to ignore. You can delete this if you don't have the courage to take this hate after messing a class so bad. Just one final thing, it's best for the players if you guys quit sooner.", "author": "Shiorie"}
{"url": "/forums/en/wow/topic/20752649808", "title": "Suggestions for Improved PTR Communication", "replies": "11", "first_post": "Just to put this out there up front, please try and keep this constructive. I really want to avoid this turning into a \"F* Blizzard\" \"You guys Suck\" \"Unsub to teach them a lesson\" thread. I would like to keep this focused around what Blizz can do to provide better communication specifically with the PTR Cycles (since this is on the PTR Forums). I thought of three to start, that seem to be the most common things i saw throughout the PTR Cycle for 7.1.5 Patch Notes for PTR Builds It seemed like one of the biggest issues with the PTR Cycle was that pretty much the only source we had for build patch notes was third party sites like MMO Champion and WowHead. And that came with frequent communication from Blizzard saying that \"their datamining isnt completely accurate, ignore it\". In my opinion, the class changes and such for a PTR Cycle should be available via official, accurate patch notes directly from Blizzard and we can rely on third party sites for data mining other things like new achievements, new mounts, etc. Personally I really liked the format that the beta cycles had where there was one set of patch notes, and every time a build was released, the notes were updated with the latest changes. Can we get that for PTR Cycles as well? Doesnt need to be anything terribly detailed, just a list of the class changes that we can know is accurate. Cause the alternative is third party sites datamine the changes, Blizzard says their datamine isnt accurate, players get upset about some datamined change, Blizzard has to step in and say that was a tooltip error and it wasnt changed, player gets confused, no one knows what is accurate anymore. Class Specific Goals and Problems you are trying to fix Another major issue I saw throughout the class forums and this forum is that the players have no idea what problems you are trying to fix in the PTR Cycle, so when we see the changes (without any context for the change) we tend to get angry and upset because x was nerfed or some spell was touched when there is another spell that is a bigger issue and then we come here begging for communication because we are lost as to what you are trying to do. In my opinion, if at the beginning of the PTR Cycle, before ANY changes are made to the classes, if you posted something that listed all the specs (or just the ones you are planning on working on) and listed the issues you are trying to fix ... then we would know what you are trying to do so the changes hopefully make more sense. As an example, for mages, if at the beginning of the PTR Cycle you had posted something like the following, i think we would have understood things a little more ... Fire Mage: Too much of Fire's damage is inside the Burst Phase (The Combustion WIndow), we want to take away some of the damage from the Burst Phase and buff up their sustained damage to match Arcane Mage: Quickening dominates the spec and creates a lot of issues. We want to change around Arcane's talent tree so we can balance Quickening with the other options so Quickening isnt a guaranteed choice. Overall Secondary Stats: Secondary Stats have dominated gear too much making them in many cases more valuable than primary stats. We would like to balance this better so that the Item Level/Primary Stats on gear matters instead of an item being worthless because it doesnt have x secondary stat. I believe that something simple like that at the BEGINNING of the patch cycle would make all the difference. With that information, we can focus our feedback around those goals and problems that you posted. So now we can make our feedback relevant to your goals as opposed to just reacting to whatever the latest build had in it. Easily accessible information All of your communication regarding the PTR Cycle should really be posted on the PTR Forums where your testers are going to be able to see it easily. We shouldnt have to follow the PTR Forums, Twitter, Third Party Sites, Q&A's, Developer Interviews (third party interviews), etc. just to be able to get all the info about the PTR Cycle and Changes. Otherwise it turns into \"Well they said this on twitter, and then in this interview with X they said this, the datamined changes said this, and in the Q&A they said this ...\". Its fine if you post things via other mediums, but anything related to the PTR should be posted (or copied) here where it is easily accessible. Those were just a few that i came up with, if anyone else has something they would like to see in regards to communication, feel free to post it. Overall I just think that a LOT of communication concerns can be alleviated by giving some basic info up front instead of halfway through the ptr cycle, or as the cycle is completing (if its given at all). Especially if you want our feedback on changes, we need to know where the goal line is!", "author": "Sharrq"}
{"url": "/forums/en/wow/topic/20752540676", "title": "Where are the baseline talents?", "replies": "2", "first_post": "Lol seriously blizzard? Who is in charge of this? Who would make claims and not uphold to these claims? I don't want to hear \"Oh people are sick, boohoo.\" Listen, if you promised something and blame it on holiday breaks and illness, this company has lost all sense of integrity. Lies and more lies that are awkwardly covered up by CM members. What talents got baselined? Was blizzcon all lies? Sure there were small tweaks but legitimately there are no talents made baseline. GG blizzard, you guys straight up failed.", "author": "Vanmire"}
{"url": "/forums/en/wow/topic/20752519594", "title": "Patch notes: Artifact 35+ points on PvP", "replies": "4", "first_post": "*Cross-posted from the Battlegrounds forum* From patch notes Artifact traits at 35 points and above are now enabled in PvP http://www.wowhead.com/news=259071/official-patch-notes-for-world-of-warcraft-7-1-5 I feel this goes against their philosophy at Legion's launch about gear dependance on PvP. This makes me really sad because the moment I got my +5% damage artifact trait, I left the Broken Isles and quit the AP grind to enjoy the rest of the game, which mostly involves watching people duel, assisting guildies, provoke WPvP, or simply walking around my favorite areas. Please revert this change.", "author": "Garmagus"}
{"url": "/forums/en/wow/topic/20752640535", "title": "7 Sec vuln returns in 7.1.5 patch notes?", "replies": "7", "first_post": "During the PTR it was determined that a 7 sec vulnerable created a hard breakpoint for haste at about 22%. This breakpoint allows for 3 Aimed shots to be fit into a single Vulnerable if the lvl 15 focus regen talent is taken. There was a blue post on this and vulnerable was reduced to 6 seconds to avoid that. Patch notes put it back at 7. Now I know patch notes went up literal minutes ago, but with the patch coming tomorrow could we get some clarification on this?", "author": "Prox"}
{"url": "/forums/en/wow/topic/20752510646", "title": "7.1.5 devs sht on players", "replies": "8", "first_post": "they did not do any of the stuff the players asked them to do in forums.so much wasted good player input", "author": "Knasth"}
{"url": "/forums/en/wow/topic/20752565763", "title": "Will Aff Warlock Stuck In Combat Be Fixed?", "replies": "11", "first_post": "I'm wondering if they are planning on fixing the affliction warlock stuck in combat in BG's bug? Today I had to run on foot the entire length of WSG after rezing to get to the enemy building, yes without casting a single spell or seeing an enemy.", "author": "Benjiboots"}
{"url": "/forums/en/wow/topic/20752610601", "title": "Brutal Gladiator's Dreadplate Set", "replies": "2", "first_post": "Can anyone confirm if the DK Brutal Gladiator's Dreadplate full set has been put back in game? The vendor that used to have it in Area 52 has not had the full set for a few months now. Cant copy my DK over or i would check, and dont wanna go through the DK starting intro all over again to look lol.", "author": "Abyss"}
{"url": "/forums/en/wow/topic/20752429234", "title": "Patch Imminent... Almost Zero Dev Feedback", "replies": "22", "first_post": "Outlaw has a huge thread, with literally zero dev feedback in it, and a passing (bull!@#$) comment on RtB by Ion during the Q&A... yet we are poised to have several changes (mostly nerfs), almost none of which address the community's concern with HOW THE SPEC PLAYS AND PERFORMS. It's like we're talking to a brick wall. At the very least I'd appreciate: RtB RNG concerns: \"we're right, you're wrong, RNG is FUN, !@#$ off\" SnD viability: \"we're right, you're wrong, SnD isn't RNG = NOT FUN, %^-* off\" Energy starvation: \"we're right, you're wrong, Who needs Energy, don't rogues use mana?, !@#$ off\" Blurred Time concerns: \"we're right, you're wrong... Hey wasn't that the talent we let the intern work on??? DId anyone QA that??? Oh Celestalon said it was gtg.. OK we're good.. !@#$ off\" At least then I'd know a dev (however misguided / incompetent) read SOMETHING!!!", "author": "Shaden"}
{"url": "/forums/en/wow/topic/20752408615", "title": "While We're Communicating - Disc 3v3", "replies": "2", "first_post": "Hey there - myself (and many of your players) appreciate the attempted improved communication that we've seen in the last 24 hours or so. Thank you for that - I think the biggest issue that people find here is sometimes voicing opinions, regardless of the manner in which they're phrased, is like an echo chamber without any feedback from the company the develops the game we've all loved for years. Personally, I've been playing since before BWL was released in Vanilla, so I can understand how tumultuous things can get and it's admirable that you are still trying to improve how you communicate to your players. I'll skip right to what I'd like addressed - and there have been many threads concerning this issue. Disc just isn't very viable in 3v3. It's certainly Glad capable in the hands of a select few players, but it certainly doesn't bring almost anything to the table that other healers don't already provide. A couple concerns that should be looked into or at least responded to: Disc has the worst crowd control of any healer and that's including Mind Control. Keep in mind MC is still intermittently buggy to where leveraging it in a game can prevent using Penance, Trinket, etc. for the duration of the match. Also MC essentially CCs the casting Disc as well, which seems really punishing for one of the healers with the fewest catch up mechanics. We can't spend time channeling an MC because without a CD coming out of it, we can't catch back up typically. Psychic Scream also requires melee range, and although it has a relatively short CD and is AoE, you've kept Disc as the healer with by far the least mobility (even with Feathers, which aren't a very 'fun' mechanic in my opinion). I find that in 2s games or the small amount of 3s games I've forced myself to q this season I can barely even reach an opposing healer to fear them. Something should be done to bring Disc's crowd control in line with healers or at least give them meaningful and trustworthy mobility. Many talents (honor and otherwise) are pretty underwhelming. Blizzard has said that if there are talents everyone is taking they are looking at baking those talents into the spec. Archangel is a great example of this, as it's a prerequisite healing CD. Outside of maybe some outlier RMP, WWDK or maybe WWMP - no one is taking Dark Archangel because we don't have enough healing throughput to keep anyone upright even when our opponents aren't using their offensive CDs. If we eat one crowd control effect we better have Archangel coming out of it, or we'll end up really far behind. Another few good examples would be The Penitent, Psychic Voice, Mind Bender, and Grace. I want to specify that I don't think anything other than perhaps Psychic Voice and the Penitent would have any reason to be baked into Discipline's kit - just that the other talents alongside all of the aforementioned abilities typically don't keep up in Arena. Lastly, and this has been the case for some time now, the throughput on Divine Star and Halo is pretty abysmal. I remember a while back (could have been a few years now) reading a post from Blizzard about talented abilities being designed so they are a fun button to press. Personally, while Halo has it's place in PvE, none of them are typically exciting. Clarity of Will is okay, but usually our Atonement throughput isn't high enough to top someone while the shield prevents them from dipping lower. That's one of my biggest gripes, I think, is that in PvP Disc was designed initially to be offensive (I'm talking back to LK days with double offensive dispel, for example) and they had mechanics like PW: Shield in order to prevent further damage while they were being offensive and nuking with Mind Blast. Now, PW: Shield doesn't have things like D. Aegis, Mending, Renew, etc to prevent instantly being dispelled - and the actual shield itself is moderately weak when compared to burst.", "author": "Narthypoo"}
{"url": "/forums/en/wow/topic/20752510850", "title": "Can balance druids get a blue post?", "replies": "4", "first_post": "Gapezilla cross posted a very good discussion thread discussing the issues with balance druids, and there has been 0 response to it. I have been following the forum posts for balance druids for months now. Out of all the changes I have seen, it feels like none of our suggestions have been taken into consideration. Ignoring the fact that our single target is middle of the pack at best, the only thing you focused on was talent changes to the AoE talents. These changes don't feel like they address the issues for our lack of AoE damage. The biggest thing we needed was a baseline buff, and all we got was a measly 4% to counter the fact that the ED helm was nerfed. Starfall is not in a good place, and to call echoing stars a gold dragon node is frankly, an insult. Echoing stars got a buff from 8.6% to 11% spell power. It hits one extra target at my current ilvl for about 3800. How is this a buff? You have real aoe classes like fire mages, DH's, and monks doing way more damage because their spells actuall hit for a good amount to all targets instead of 1 extra for 3800. I am not expecting every class to be equal in every aspect, but we simply can not compete at all for AoE dps. It was virtually not an increase to our dps, and was a wasted node in our artifact. Taking the new talents for AoE will only marginally increase our AoE dps but make our single target suffer severely, so why do it? My point is, out of all the brilliant ideas that could buff our AoE without taking a hit to our single target, none of them even came close to being a change. It not only feels like we are being ignored completely, it feels like people with a complete lack of balance druid knowledge is in charge of changing us. I would be interested to hear from other players about this post, but I am mostly interested in hearing from @Ornyx. You have left us completely in the dark for a while now, and the lack of communication and willingness to consider our thoughts on the class is disheartening.", "author": "Ebrithill"}
{"url": "/forums/en/wow/topic/20752550390", "title": "Chrono Shift", "replies": "3", "first_post": "I really wish this ability wasn't tie to Arcane Barrage. With the 7.1.5 we'll never even cast Arcane Barrage anymore. Might as well just take it off our bars. it'd be nice if it was something we could trigger outside of combat somehow tho.", "author": "Wardlaw"}
{"url": "/forums/en/wow/topic/20752317435", "title": "No big changes to warlocks....", "replies": "6", "first_post": "Life Tap increases your damage dealt by 10% for 10sec now '12% for 15 sec' Oh !@#$ better pick that over Reverse Entropy.....pathetic oh and Shadowburn is still completly useless in pve and pvp GOOD %^-*ING JOB BLIZZ ffs what are these idiots doing.", "author": "Keeperoftime"}
{"url": "/forums/en/wow/topic/20752610868", "title": "WOW TOKEN", "replies": "2", "first_post": "i cant buy a wow token it tells me i have to many of that item i had already bought wow tokens before. do i have a limited to buying wow tokens?", "author": "Lorrdhunterr"}
{"url": "/forums/en/wow/topic/20752500742", "title": "35+ Artifact traits are now enabled in PvP", "replies": "14", "first_post": "Horrible idea. Fix it please.", "author": "Heltor"}
{"url": "/forums/en/wow/topic/20752589513", "title": "The effect of the secondary stat nerf in pvp", "replies": "1", "first_post": "Hey all - I just want to bring this to your attention (again). Many specs are getting %damage/healing/effect buffs to the base values of their pve spells to counteract the secondary nerf, in order to keep power roughly the same. The effect of this in instanced pvp, where secondary stats are set by the template, is a massive %buff to damage for a lot of spells. This is going to massively throw off pvp balance. Please get ahead of this and adjust templates accordingly with 7.1.5.", "author": "Bertimus"}
{"url": "/forums/en/wow/topic/20752599083", "title": "Frost DK Tier nerf", "replies": "16", "first_post": "Apparently you felt the need to nerf a set bonus that wasn't even that great, while buffing Ret set bonus. Not only did they already have stronger set bonuses, but they are currently a much stronger spec. This is after they received flat % buffs to their damage, while we haven't received any, while they are already much better on live. Your blatant hatred of our class is unappreciated, as is your favoritism of others.", "author": "Akusalol"}
{"url": "/forums/en/wow/topic/20752500416", "title": "Catchup: What happens to AK I am researching?", "replies": "12", "first_post": "What happens to Artifact Knowledge I am researching, when I learn the AK20 book? Does it reset my research to 5 days? Does it just delete them? If they are finished, but not picked up, can I still learn the AK20 book, then pick them up and get 22 straight away?", "author": "Elenia"}
{"url": "/forums/en/wow/topic/20752540855", "title": "Rip Prot war", "replies": "11", "first_post": "An incredibly thoughtful post from Vlurg in the Warrior thread. I figured this was a great place to put this info. So.. patch is live. the stats squish didn't as hard, but heavy repercussion shield block duration has been nerfed by 33%... so we still need more haste to make up for it. The new Devastator talent feels horrible... spend most of my time doing nothing watching auto-attack. Yet, there's no way we can fit revenge in a ST rotation witout using devastator ; there's just no GCD to waste on a mediocre dmg ability when we have to fish for shield slam proc even harder now. This also means we get less overall IP cast; since we hardly ever use revenge, we hardly ever get a cost reduction on IP... previously we could use FR-IP out of the GCD... not anymore. with 31% haste + into the fray AND devastator i can barely keep shield block up... more like a 90% uptime depending on proc rate... thing is, without indomitable my IP are soo weak it's laughable... what the heck am-i gonna do wit a 800k IP when mythic guarm autoattack for 2 million? that's ridiculous. ilvl889 btw. Battle cry is now kinda useless... can't use it to get a big IP anymore, can't use it to 'burst' either (no more FR...no more 2 million shield slams...) So in the end, we have to stack haste even harder, likely over near 40% haste if we want a 100% shield block without devastator (which is a 25% hp/IP nerf), we cast less IP overall... oh and, I went from sustain 280-300k dps to sub 250k. if any tank cared about dps. my one and only mythic dungeon so far went horrible... thunderclap isn't enough to hold aggro (well, it's skittish) and I can't get enough rage to revenge... because i don't have aggro. Rerolling paladin.", "author": "Tatonkatruck"}
{"url": "/forums/en/wow/topic/20752430002", "title": "Automatically Give 54/54 Traits in PvP", "replies": "6", "first_post": "Considering you get 0.75% stamina per trait unlocked and the damage bonus beyond 35 is 0.5% per trait give everyone their full artifact weapon traits in instanced PvP and that should help with the obscene damage that is likely to come from a fully geared artifact weapon against one that is not. Correct me if I'm wrong.", "author": "Failedwizard"}
{"url": "/forums/en/wow/topic/20752450554", "title": "Feral community NEVER communicated with", "replies": "26", "first_post": "I honestly don't know what goes on behind the scenes where feral is concerned, none of us do, our existence is never acknowledged. We got some cool graphical updates in legion but have fallen flat when it comes to everything else. There are so many problems with our class at the moment, some which have been around for years, namely our worthless AoE and our viability in Mythic raids due to our lack of AoE and utility (and tbh, now we're falling behind in ST). Now comes 7.1.5 in which a headscratching/unnecessary OoC change makes our rotation harder and clunkier than ever; our set bonuses make no sense (2p is a 0% increase), we receive a nerf to our rip relics; our JW, SR, BT talent options will still remain to be selected 99.99% of the time (so much for baked in); we lose utility on our displacer beast; we get our new legendary wasted on Maim (ROFLLOLOL); 5% nerf to crit (cya CP gen); and to top it all off, all of the concerns that we've had since alpha and beta still remain ignored. Our appalling AoE is supposedly because we're a ST niche yet multiple mouth-breather specs outdo us in both departments. We're referred to as the most difficult spec to play; yet risk reward is currently non existent. We've been pleading for some sort of insight into whats happening and specifically been begging for OoC changes to be reverted and have heard NOTHING, we don't even know WHY it needed to be changed in the first place so why touch something thats not broken. We had the same issues with being left in the dark in WoD and all through Legion Alpha and Beta. Is there even a development team for feral, has blizzard forgot druids have four specs?", "author": "Dominatii"}
{"url": "/forums/en/wow/topic/20752660271", "title": "Assassin Rogue Hidden Change", "replies": "1", "first_post": "Small relic, \"Master Assassin\" with 3 relics now only reduce CD for 48s, was 60s. Is this a bug or it is a hidden change ?!", "author": "Meril"}
{"url": "/forums/en/wow/topic/20752580559", "title": "How can we expect classes to get better?", "replies": "1", "first_post": "I'm genuinely curious and want to understand, how can we expect the classes to get better since Blizzard is rushing the patches? How do you expect to make the game better when you're not even \"trying\" to communicate with the players? This patch disappointed me just like the others", "author": "Conkers"}
{"url": "/forums/en/wow/topic/20752675744", "title": "Patch notes?", "replies": "13", "first_post": "So you put out a survival guide video for 7.1.5 which specifically says \"check out our patch notes for more details\" at the 0:41 mark... Where?", "author": "Jerauld"}
{"url": "/forums/en/wow/topic/20752610747", "title": "Please tell me you guys just forgot", "replies": "8", "first_post": "Is the ghoul going to do shadow damage when transformed or not? This is by far the most important change. Did you guys scrap it? If you did, this spec is 100% still in the gutter. Please tell me you guys just forgot to write it in.", "author": "Tomyre"}
{"url": "/forums/en/wow/topic/20752610690", "title": "Thoughts on 35+ Traits being unlocked for pvp", "replies": "37", "first_post": "I think it's a terrible decision. Now we have to get 50 honor talents AND 54 traits to be truly competitive. This kills ALL alts and OFFSPECS. It makes the grind even more intimidating and time consuming, thus making players quit / not try at all. I don't know what you're thinking Blizz, I truly don't. This seems counterproductive considering templates in pvp were introduced to keep things like this from happening. Honor level is the grind for pvp, don't make us have to grind insane amounts of AP.", "author": "Wtbchipotle"}
{"url": "/forums/en/wow/topic/20752535451", "title": "[Request] Disc Changes", "replies": "19", "first_post": "This is cross-posted from the Priest Forums. Originally posted here: https://us.battle.net/forums/en/wow/topic/20752169010 There are a couple quality of life changes for Discipline Priests that most of the community would like to see, so I wanted to put it in one place for everyone to comment on and discuss so that we can maybe see some positive outcomes. DPS Filler We need a \"free\" (no mana cost) DPS spell that doesn't proc Atonement. Smite is a great ability, but spamming it as a filler is not effective in a raid setting. It is a drain on mana, however, it is extremely important to our healing rotation since it's our DPS filler for Atonement bursts. Right now, as a Discipline Priest, we spend much of the fight between major AoE not casting anything besides Penance and PW:S, which are both on cooldown for a period of time. Changing Smite to be mana free and having no proc to Atonement would effectively be a nerf to Disc. A new spell would need to be added. We need a Shadow spell added to the spec that can fill in some GCD gaps that Disc currently has (Mind Blast / Mind Flay maybe?). One of the problems with Disc right now is we sit around wasting a lot of GCD's by not casting when it's not necessarily productive. People newer to the spec gravitate towards spamming Smite during low damage periods of an encounter and it results in them having mana issues. I think, as a community, we all want a more active play-style. Having another ability to use to fill in those gaps would be excellent. (optional) Disc also could use some form of AoE that doesn't proc Atonement. Holy has Holy Nova which is an extremely mana efficient AoE ability, but Disc has nothing (not counting talents like Divine Star / Halo as actual AoE). I think giving Disc Priests Mind Sear would solve some of our issues with contributing AoE damage in periods of low incoming damage during dungeons / raids. Trinkets As many aren't aware (since Discipline is a rather under represented spec at the moment), Disc received a nerf to the damage of DPS trinkets earlier in the expansion. This nerf essentially made any DPS trinket obsolete and basically vendor trash. The problem with this is that they still remain on our loot table, and there is a chance that we can get them in our M+ cache, M+ chests, boss drops, coining on a raid boss, etc. The alternative is we could set our loot spec to Holy, but then we will get Holy legendaries instead Discipline. Our request is that you either make DPS trinkets worth taking for Disc, or you remove them from our loot table. Thank you for reading, and I hope to see a great and lively discussion regarding these QoL changes that are needed for our spec.", "author": "Mènd"}
{"url": "/forums/en/wow/topic/20752265792", "title": "Power Word: Void Shift (Thread has merged)", "replies": "30", "first_post": "Thread is merging with: http://us.battle.net/forums/en/wow/topic/20752345033 Please go there to continue the discussion.", "author": "Matanto"}
{"url": "/forums/en/wow/topic/20752649939", "title": "Feral Changes", "replies": "1", "first_post": "Recently looked at the 7.1.5 Notes and saw a nerf on \" Razor Fangs Increase damage dealt by Rip by 7%4%.\". I'm trying to figure out why this is needed, considering our aoe is terrible we need a single target nerf to even it out ? Yes, the pvp buffs are great and supply a nice variety of options. But PvE seems to be where we are lacking in terms of flexibility. (Not including raid performances which most of the times we perform well).", "author": "Shìftz"}
{"url": "/forums/en/wow/topic/20752500016", "title": "Subtlety Rogues need to be fixed", "replies": "36", "first_post": "1. Honestly the fall of Subtlety Rogues was the addition of Shadowstrike, this ability should never have been turned into our main attack to generate CP. We should have kept Backstab as our main CP builder, and Gloomblade as the secondary. 2. Shadow Dance should not have 3 charges, it should only have 1 charge at a 60 sec CD with an 8 sec last period, Shadowstrike should be our \"use while stealth, or while Shadow Dance is active\" ability, much like Ambush. 3. Symbols of Death should never have been introduced to the game, an ability with almost no CD and provides a consistent 20% overall damage buff is ridiculous, the 20% damage should be baked into the class, and Enveloping shadows should take the place of Symbols of Death. 4. Deeper Stratagem should never have given a 5-10% damage increase to finishing moves, this should be baked into the spec, and allows the other level 45 tier Talents to be viable. 5. If Shadow Dance was adjusted back to a 60 sec CD, Subterfuge should be baked into Stealth for Subtlety Rogues, allowing the use of abilities which require stealth for an additional 2 seconds. I've no idea why the Talent Subterfuge exists, but because it does, it makes the other 2 level 30 tier Talents useless. 6. Feint should not be getting an energy cost increase after 12 years. 7. Slows should not be reduced to 30% across the board. 8. Instanced PVP damage should not be reduced by 55% across the board. 9. Poisons should be part of all Rogues Specs 10. Gouge should be part of all Rogue Specs 11. Subtleties biggest damage dealer, and only slow is Nightblade, this ability should not be cleansable, not only does it drop the damage completely, but it drops our slow, it's not like we can spam it like Assassination can with their Crippling Poison. Hence another reason why Poisons should be part of all Rogue Specs. Remove slow from Nightblade, at least give back Crippling Poison to all Rogue Specs. Blizzard does not know how to properly balance a class, they said they wouldn't be doing a number changes to fix the class issues, they said they would bake highly use abilities into the \"Class\", not just the spec. And they only did this for Blind, and Hunter Traps. All I see for Rogues is, number and % changes to Legendaries, Abilities, and Talents. Yes Subtlety does fine in PVE now, but next patch since our boots were nerfed, this will not be the case, we are now very energy starved while using Deeper Stratagem. And issues within instanced PVP is still unchanged, we still have a 55% damage decrease. I feel completely lied to.", "author": "Phay"}
{"url": "/forums/en/wow/topic/20752348267", "title": "Protection Warrior Changes", "replies": "3", "first_post": "I know there are lots of classes that need help and just as many that are unhappy with the changes that are on the PTR right now, but I have just raise my concern about the toon that I’ve been enjoying playing. What is the reason for the changes to the Protection Warrior rotation/priority system (Thunder Clap, Revenge, etc.)? I really like the way it feels on live and I have FUN playing it. I’ve been playing around a little on the PTR and I do not enjoy the changes that have been made at all. I’m assuming a lot of players are upset right now because things are being changed for seemingly no reason. Was my rotation/priority system OP?! Is anyone complaining that Warriors are not fun to play on live? I can understand if numbers need to be tweaked or if unused talents need to be buffed, but I can’t understand what you’re doing in this upcoming patch. I wonder who you are making these changes for because it doesn’t feel like they are for the player. Thanks", "author": "Kragle"}
{"url": "/forums/en/wow/topic/20752610546", "title": "Holy Priest FTW", "replies": "6", "first_post": "Many Holy Priest PVP players have been swimming upstream in Legion. I, as a Holy Priest, am pretty excited for what is to come in this patch. Lets bag um' and tag um' boys.", "author": "Tsilo"}
{"url": "/forums/en/wow/topic/20752610788", "title": "Legendaries % to get ever reset upon specs?", "replies": "1", "first_post": "Legendaries: Will chance of getting a legendary ever reset upon changing specs? I have 2 restoration legendaries and ive been told that switching to Guardian spec the system doesnt count how many guardian legendaries I have but goes off the entire amount. So its gonna take forever and a day to get my 3rd legendary which is actually only my 1st in Guardian spec. Can somethin be done about this, like making the system only count total legendaries based on your SPEC not overall? Cause switching main spec to another main spec just screws you over in the current state of things when it comes to Legendaries. I'd trade in my restoration legendaries if I could just to get Guardian Legendaries. Right now there's no telling when ill get my first guardian legendary. Or id happily trade them in if blizzard would view me as having zero (as if I obtained zero and work like it did when getting my very first).", "author": "Kozyx"}
{"url": "/forums/en/wow/topic/20752288210", "title": "7.1.5 Engineering", "replies": "3", "first_post": "Just curious about the new 880 goggles. I may be in the minority on this one but personally I don't mind farming the mats (outside of bgs I normally stick to solo content and farming works well for that) but I am worried that the schematics are gated through content requiring a prearranged group and not random queued or soloable (ex.. the 815 goggles). Not one to complain but I cannot find anything on how to acquire the schematics. TIA Em@Darkspear", "author": "Emdefender"}
{"url": "/forums/en/wow/topic/20752489657", "title": "Last minute ninjas changes", "replies": "2", "first_post": "It's the morning of the patch and Rogues are reporting a last minute nerf to our best Assassination artifact trait. Not yet documented on notes. Any other classes experience this?", "author": "Spoobypls"}
{"url": "/forums/en/wow/topic/20752639713", "title": "Arena Participation Down 85% Since WoD", "replies": "27", "first_post": "How will Holinka and Celestalon be held accountable?", "author": "Ghostshoes"}
{"url": "/forums/en/wow/topic/20752529400", "title": "Pvp changes", "replies": "2", "first_post": "Artifact traits at 35 points and above are now enabled in PvP. Now tell me who's idea was to do this? This is not a good change at all.", "author": "Hoofmunguss"}
{"url": "/forums/en/wow/topic/20752599432", "title": "So about that Balance Druid buff.", "replies": "6", "first_post": "Hello dev team. Hope your holiday break went well. Happy your back and ready to make due on promises by your GD, Ion Hazzikostas, on 12/07/2015. As follows here is the quote from the Q&A. ... So far, you've gone ahead and nerfed the legendary, however we've been patiently awaiting the buff that clearly was stated that we were going to receive. Just so you are aware, we do not feel as though scaling stats are a buff. It's a game mechanic. So far the balance druid for the most part has been ignored. Our feedback especially has not been heard. Here are a list of threads since legion that have been discussed that we have yet to have dialog. https://us.battle.net/forums/en/wow/topic/20752506278?page=1 https://us.battle.net/forums/en/wow/topic/20750374936?page=1 https://eu.battle.net/forums/en/wow/topic/17614632256#1 (link to the original) https://us.battle.net/forums/en/wow/topic/20749729173?page=1 The buffs, to the talents that were spoken to were previous to the 12/07 Q&A and do not address any issues with the spec.", "author": "Skyotter"}
{"url": "/forums/en/wow/topic/20752495288", "title": "Arms talent Mortal Combo", "replies": "33", "first_post": "Can this talent get a little love to make it more competitive with focused rage. Even a passive crit chance on mortal strike to make it more of a sustained damage choice (would only help outside BC) while leaving focused rage as the go to for burst and top end players would be nice. For example... Mortal Combo grants 2 charges of mortal strike and increases the critical strike chance of mortal strike by 30% (reduced in pvp) Just a little something would be nice so there is a choice that doesn't destroy your dps as much as it currently does mostly talking pve. PS. In for the kill could use more love also perhaps extending the execute phase abit. Edit for misspelling.", "author": "Lumb"}
{"url": "/forums/en/wow/topic/20752669853", "title": "Copying toons over", "replies": "2", "first_post": "Did the take away the button to copy toons over to the ptr on the login screen? Or am I just not seeing it?", "author": "Gwyndor"}
{"url": "/forums/en/wow/topic/20752500413", "title": "Please revert sub 4 set bonus back to 100%", "replies": "7", "first_post": "you've nerfed us enough cant we have anything to look forward too? i was planning to change my spec up once i had it but with this change its back to cookie cutter. this spec has enough RNG we dont want anymore. if its not changed back there is no point having the 4 piece at all, every sub rogue will just have the 2 piece and not bother with the 4. im sick of RNG im so over it", "author": "Griever"}
{"url": "/forums/en/wow/topic/20752589990", "title": "Q&A 1/12/17", "replies": "11", "first_post": "https://worldofwarcraft.com/en-us/news/20467832/watch-the-legion-live-developer-q-a-with-paul-kubit-thursday Just gonna leave this here for you guys.", "author": "Jentrax"}
{"url": "/forums/en/wow/topic/20752599438", "title": "understanding simulationcraft", "replies": "8", "first_post": "I really dont get this site it like changes so much every few days even when using the same builds for specs .. Is it best to disregard it completely or am i missing something ?", "author": "Crimsonita"}
{"url": "/forums/en/wow/topic/20752489522", "title": "Legendary upgrade, explain please!", "replies": "4", "first_post": "I have heard different rumors on how your current 910 legendary items will be upgraded. One rumor: On Tuesday, the legendary will just go to 935 (I think that is the number) Another rumor: You have to do a 8 week quest, collecting 10 shards per week. Possibly you could have already collected 80 shards and just hold them?", "author": "Tyee"}
{"url": "/forums/en/wow/topic/20752537895", "title": "Cord of Infinity", "replies": "16", "first_post": "For a legendary that reads, \"the magic contained inside seems to be as endless as the Burning Legion\", Cord of Infinity's effect is extremely weak and the amount of mana it provides throughout the duration of a fight is negligible, i.e. not even enough mana to cast an additional Arcane Blast before having to use Evocation. Any word on if this legendary will get buffed/reworked, or at least some sort of explanation as to why it is not getting touched? For a class-specific legendary, what is the design philosophy behind this item? Since it was designed, Arcane's mana costs increased from 100% to 125% per Arcane Charge, making it even worse.", "author": "Yurippe"}
{"url": "/forums/en/wow/topic/20752566607", "title": "Justification for warlock nerfs", "replies": "17", "first_post": "Is there a boost coming to spells for warlocks because I just can't figure out why they keep getting nerfed. Demology will suffer once more because of nerfs. Is there going to be an easier way to restore artifact power because it looks like yet another artifact switch and the system is starting to become old and lame.", "author": "Soulreåper"}
{"url": "/forums/en/wow/topic/20752450447", "title": "RET PALLYS RUINED", "replies": "41", "first_post": "REDICULOUS NERFS. They took away might, and buffed kings... okay whatever. Dealable. Then NERFED whisper of the nathrezim. also dealable but totally REDICULOUS. Then nerfed Devine intervention. LIKE WTF ARE YOU GUYS DOING?? THEN NERFING FoJ!?!? WTF!?!? WHO IS IN CHARGE OF RET PALADINS RIGHT NOW...?????? Our movement isnt that great and now a -15% strength nerf OH MY GOD!!!! DUMB AS ****!! I don't like how blizzard is pushing me into using justicars vengeance for PvP, I DONT LIKE IT. It got nerfed anyway!! How the hell are we supposed to do any damage and stun anybody after trinket? By the time FoJ does anything they'll have trinket back. TOTALLY PISSED OFF. may as well scrap the entire class blizzard. REDICULOUS!!", "author": "Palonthor"}
{"url": "/forums/en/wow/topic/20752610584", "title": "Nighthold bosses that proc Sephuz's Secret", "replies": "1", "first_post": "I have not been able to test the raid, so please let me know if I missed anything or if a a certain mob listed wont proc Sephuz's secret. List of possible CC or interruptible adds: Skorpyron - Spawned Scorpids. Chronomatic Anomaly - Depleted Time Particles, and Waning Time Particles. Trilliax - N/A Krosus - N/A Elisande - Time Elementals. Spellblade Aluriel - Fiery Enchantments. Tichondrius - Tainted bloods, Phantasmal Bloodfangs, Spellguards, wizards. High Botanist Tel'arn - N/A Star Augur Etraeus - Voidlings Gul'dan - NA Edit: updated list based on comment feedback.", "author": "Frostshade"}
{"url": "/forums/en/wow/topic/20752287440", "title": "Revert 7.1.5  Secondary Stat Changes", "replies": "437", "first_post": "Currently on PTR, an unannounced change (as far as mmo-champion is concerned,) has lowered the amount of secondary stats every class has from their currently equipped gear. On live, I have 44% crit and 118% mastery. On PTR I have 37% crit and 110% mastery. This change does literally nothing to encourage people to take iLvl upgrades over secondary stats. It simply just neuters classes from being able to function optimally. I'm not sure how this effect hits classes like Shadow, but I'm assuming it's far worse than Assassination. Please, Blizzard, adjust this useless change and try to approach it in another manner, like adding primary stats to jewelry. (Edit: My gear is currently optimized extremely well, and it still destroys my dps by over 50k, due to being unable to generate CP as effectively. If someone isn't optimized as well as I am (for SIN) they probably will do far, far less damage). (SECOND Edit: What does this mean for Mythic Guarm and Ursoc? Currently the DPS check for Ursoc is like 300 - 330k, and I've heard Guarm is much higher.) (Third edit aye: Realized 5% is from a baseline crit reduction for agility characters. Still a 3% crit reduction and a 10% mastery reduction, which is pretty large. In general, losing that much crit in total is a DPS shutdown, so, still extremely dissatisfied.)", "author": "Gucciunicorn"}
{"url": "/forums/en/wow/topic/20752440193", "title": "Could you please fix trinkets", "replies": "1", "first_post": "So looking at the trinket list for the 7.1.5 ascendence build there is a problem. A 840 mastery stat stick beats out my 885 swarming plaguehive, 865 twisting wind, 855 naxx spiked tongue, 855 Devilsaur shock baton, 865 Aran's relaxing ruby, 870 oakheart gnarled root. I thought the idea in 7.1.5 was to make 10 to 15 Ilvl upgrades always better so your not always guessing what's an upgrade. What happened? Also the two BIS trinkets are arcanocystal and padas unlucky charm which are from two random world bosses. Any plans to fix any of this??", "author": "Applefriter"}
{"url": "/forums/en/wow/topic/20752275953", "title": "The new legendary system sucks", "replies": "342", "first_post": "You heard me. I've seen a dev debating this point made by a poster \"say dps A gets his bis legendary and same class dps B doesn't, the guild would take the one who does the most dps, the one with his BIS legendary\". He replied the guild would take the most helpful blabla loads of horsecrap. Very nonsensical. If you are dps, how do you help the raid? I'm pretty sure it's not by healing harder. If a guild is struggling with a raid boss, they WILL sit players with the lowest dps, don't think otherwise, you're being delusional. Also try applying to a guild with your logs... good luck beating the guy with his bis legendary if you don't have it as well. Now this brings up my title and main point: legendaries are giving lots of classes a HUGE dps boost, I've seen rogues, mages, warlocks, DKs, warriors and some others get 100k + dps boost out of their legendaries! This is RIDICULOUS considering it's a damn RNG on top of RNG. You gotta be lucky enough to have one dropping for you, then you gotta be luckier getting the decent one and not some trash stat stick. How in the hell is that considered working as intended? Then you'll try to balance classes dps against each other, how do you proceed? Balance considering BIS legendaries, and whoever doesn't have it gets the flying duck? Balance without it and whoever gets it is now flying vanilla skies with ice cream clouds? You developed a RNG nightmare and tossed some more trash into the pool in 7.1.5. and I'm specifically looking at this LAME new legendary for monks you created to parade along with every other crappy we have. Want a suggestion? Give a legendary token and we pick what we want, instead of double RNG stupidity.", "author": "Dairyo"}
{"url": "/forums/en/wow/topic/20752620325", "title": "We did what we could", "replies": "57", "first_post": "Well team, I guess this is it. We kicked and screamed, got angry and got smart with them, and let them know in as many ways as we could about all the things not cool with 7.1.5. And this is what we're getting in three days. I'm not sure that we, the playerbase, could have done more to bring about change of a different kind for our classes. I wish you luck in the coming days, and happiness in whatever venture you pursue online. I'll... probably still be here. Not many raid grps play when I do so I'll be enduring the whatever changes got through. Better luck next PTR.", "author": "Pretzéls"}
{"url": "/forums/en/wow/topic/20752670006", "title": "Elite PvP Vendors", "replies": "3", "first_post": "Did they get added in 7.1.5?", "author": "Banchee"}
{"url": "/forums/en/wow/topic/20752590120", "title": "demonology rekt!", "replies": "1", "first_post": "this patch has completely ruin demonology warlock's, everything has been reduced in damage, why did you people do this? you call this fair? i'm really upset with this right now. please fix this asap", "author": "Cawfie"}
{"url": "/forums/en/wow/topic/20752440214", "title": "Ret will be top DPS in Nighthold", "replies": "23", "first_post": "If people are behind on the news, the new trinkets and set pieces combined with the new relics will put Ret above all other classes. If you want to reroll, Ret is the way to go.", "author": "Videre"}
{"url": "/forums/en/wow/topic/20752450756", "title": "AT 54 and Instanced PVP - Please Don't", "replies": "17", "first_post": "I don't want this to turn into a flame fest or anything like that. I support alot of the changes blizzard has made, but completely disagree with allowing 54 trait scaling into the arena. I am one of the few people in the world with a max'd artifact weapon, and let me tell you, it took so many hours of play. I don't mind as much because I enjoy doing pve content and will do grinds. I grinded a thousand of Maw of Souls, for this. Thousand, and 100+ +10 keys.... However, I remember what it was like when I didn't have time for raiding and pve. I played PvP only and enjoyed it because I could log on and not spend hours on this game and still have fun. Letting this happen turns one area of the game dedicated to fair play to become, \"who ever plays more wins\". A ~15% dmg increase, and almost 20%hp increase is complete game changing and will take away insane amounts of balance. My raiding guild is laughing a storm up in gchat saying, \"We going glad tomorrow guys?\" For the love of the game and PvP (even though I don't do it anymore), don't make this change. EDIT: I feel like I'm obligated to make this edit because already I see this turning into a flame fest against blizzard. Please keep your comments civil. Discussing without insulting someone is much more likely to change the minds of a person/group. I know you might be frustrated, but please Blizzard is trying and the developers do not need your nasty comments.", "author": "Torloki"}
{"url": "/forums/en/wow/topic/20752669972", "title": "Balance Note Incomplete?", "replies": "4", "first_post": "How is it that almost all the other specs that were buffed got a \"%\" assigned to them in the patch notes... Fire mages something like 27% damage increase.. The only thing said for Balance Spells \"Damage has been increased\" ..with no % assigned? .. There are a lot of us who play balance and would like to know how much the increase will be, were not in a good spot right now overall damage wise.", "author": "Liquidscrïpt"}
{"url": "/forums/en/wow/topic/20752469231", "title": "RIP PVP", "replies": "21", "first_post": "NOW 35+ TRAITS ENABLED IN PVP. THIS MEANS SOMEONE WITH 54 TRAITS WILL BE DOING 14.5 % MORE DMG THAN OTHERS! this is so unbalanced and not fair you an no longer play multiple characters and stay competitive. GG BLIZZ", "author": "Serval"}
{"url": "/forums/en/wow/topic/20752510977", "title": "How will the general forums be tomorrow?", "replies": "27", "first_post": "This patch seems to have a ton of negativity directed towards it(Which I agree with) . How do you think the community as a whole will react to it?", "author": "Lilsmalls"}
{"url": "/forums/en/wow/topic/20752528882", "title": "Latest Simcraft Results for 7.1.5", "replies": "27", "first_post": "http://www.simulationcraft.org/reports/Raid_T19M.html It looks like Monks really got the shaft, with DKs coming in at second. Every other class has at least one spec that is simming at 450k+. Other than that on a per class basis the balance could be much worse. Specs within each class though are still pretty imbalanced, 470k vs 400k for hunters, 489k vs 432k for mages, etc.", "author": "Grishnek"}
{"url": "/forums/en/wow/topic/20752550620", "title": "I love Legion but :(", "replies": "5", "first_post": "Well here is my first post here in a long time. I'm a hardcore Everquest 2 raider who raided in top 3 ranked guilds, played various mmos along the way, bought every single WoW expansion but never managed to get attached to any of them until Legion. I'm loving Legion but I feel like I'm being forced to quit playing. So here is the short version of what happened. I started playing in Legion, rolled a warrior, decided i had a lot of fun with Arms spec, got to max level, started raiding, started doing mythic+, doing all my dailies. I realized even though I'm doing everything i can, raiding heroics, mythics, doing mythic +10/11/12s my gear level is falling behind. I researched my class, looked up WoW logs looked at what top players are doing, my rotation is similar, my spec is correct, one thing i noticed was that every single warrior in the top 100 rank had something in common, they all have the legendary gloves and legendary ring (execute ring and rage refund gloves) Well isn't that a coincidence. Well I waited out my luck, I played the game, i did every thing, all my dailies, i would run mythic+ after mythic+ and get gold and artifact power at the end ....and then my weekly reward would be a piece that isn't even a upgrade or a piece that was a side grade, GREAT have to wait another week for ONE item that may or may not be useful. I run mythics, I get gold, from every boss, rarely ever get a piece of gear. Then FINALLY a legendary drops for me, guess what, it's the boots! YES i get a little run speed, compared to the top wariors who all get execute procs and refund rage on mortal stike. Well i figured ok ..this sucks ...but i will compromise i will play another class that also enjoy. So I rolled a DK, paid for another boost, i noticed i loved Unholy, this time i did my research and saw unholy was doing horrific on damage parses. Whatever i liked the class, i started playing it, knowing i will get a legendary soon, i realized the class is virtually unplayable without the bracer legendary and even with them they are still bottom of the food chain. I figured this system cannot possibly last, it's CLEARLY broken so i keep playing in hopes of change. A legendary drops for my DK, guess what, i got the !@#$ty ring that every 30 seconds if im lucky enough to be fighting something i can stun i will get a tiny bit of haste for 10 seconds .....how is this even a legendary???? At this point I'm extremely frustrated, i can't compete with players who have BiS legendaries and have gotten lucky with their titanforged drops, on top of my bad luck, both my classes are so heavily depended on their legendary drops that without are performing way below the standards. I spent my whole holiday break playing my DK in hopes i'd get lucky, not hoping to kill that tough boss we have been working on, not hoping to get a mythic +15 ....just hoping to get LUCKY. Last week I ran a +11 with a undergeared group, we toughed it out, took us 2 hours to get through vaults, but we did it, it was tough but fun, at the end ...i got gold. GOLD. came out empty handed. Then literally 5 minutes later a guild mate completed a world quest solo in 3 minutes and got a lvl 890 relic, HOW??? after hundreds of mythic+ and raids i still dont have a 890 relic ....how could this system so clearly broken still not be fixed??? In all my life playing MMOs at hardcore and casual levels, i have never seen a loot and progression system this broken. I have never been so punished for having bad rng luck. I was SURE that Blizzard sees the problems, i was confident you would address these issues yet here comes 7.1.5 and nothing has been addressed. I don't get rewarded for completing hard content, i don't get rewarded for playing the game. Only viable way to play this game right now is to quit your job, roll 8-9 lvl 110s run dailies on each every day, and whichever one that gets lucky and gets a BiS legendary you can play it as your main and HOPE to the RnG gods that your weekly caches give you useful items or else you will be running round after round after round of mythic+ and come out empty handed. Run mythic raids, spend 4 hours progression on a boss and get gold as drop ....ridiculous. I don't want to quit playing, but at this point ...what choice do i have?", "author": "Zhouyü"}
{"url": "/forums/en/wow/topic/20752640480", "title": "Fix keystone depletion", "replies": "20", "first_post": "Hi, The last couple of reasons by keystone has been depleted is that the healer or tank has logged off completely both times, even though the group was dominating for a 3 chest. It annoys me because someone goes offline, my stone is depleted and therefore useless. If someone goes offline, and is offline for a certain amount of time during a mythic+, can everyone just get teleported back outside and the stone not be depleted? Or if someone quits the group, their keystone become depleted, and if it is already depleted, their weekly chest be reset. Just a thought, because it's extremely annoying getting 3 quarters through for that to happen.", "author": "Exorth"}
{"url": "/forums/en/wow/topic/20752511043", "title": "7.1.5 Class Changes Recapped", "replies": "1", "first_post": "I've summarized the class changes coming in 7.1.5 for several classes (sorry I couldn't get to them all). I think I've summarized them in an easily consumable way. I hope these are helpful, as I think this patch has been particularly hard to follow the final changes. Here's the list of classes I got to. I hope this helps going into tomorrow!!!! Feral Druid: https://www.youtube.com/watch?v=96NMhEMMsBI Guardian Druid: https://www.youtube.com/watch?v=tgpEb2H7u6E Balance Druid: https://www.youtube.com/watch?v=WOhSukwj-O0 Resto Druid: https://www.youtube.com/watch?v=RDnUvyHQ2GE Elemental Shaman: https://www.youtube.com/watch?v=tivAjQhMKjE Retribution Paladin: https://www.youtube.com/watch?v=hZ6o2YWRcYY Holy Paladin: https://www.youtube.com/watch?v=6VbJhsEFIeE Protection Paladin: https://www.youtube.com/watch?v=x1aybGl2qdI Destruction Warlock: https://www.youtube.com/watch?v=HcVEDjPTFTA Survival Hunter: https://www.youtube.com/watch?v=9oc0MWT3VJ0 Frost Deathknight: https://www.youtube.com/watch?v=incCW5Rz3po *If you find anything that you don't agree with please note it in the comments so others aren't confused!", "author": "Tiqqle"}
{"url": "/forums/en/wow/topic/20752675997", "title": "Tanks deserve an explanation over Prydaz!", "replies": "11", "first_post": "First let me start off this topic with a blue post from Ornyx making a statement about Prydaz ... For close to 2 months tanks with Prydaz have looked to this blue post as some sort of relief that those of us who looted this legendary. \"One of the best tanking legendaries\" a direct quote from Ornyx. Would be changed for all classes and made great for tanks. And yet today looking over the finalised patch notes for tomorrow we see that tanks are being left out completely in the cold with the buffs to the shielding it provides. The only change we are getting to make this \"one of the best tanking legendaries\" is the addition of some haste. Blizzard this goes beyond making any sense and we deserve some sort of explanation as to why tanks are being screwed over so harshly. This isn't a matter of the item not being good enough it's the fact that you actively changed it but not for the spec of class that would get the most use out of it. We deserve a response and an explanation as to why an entire specialisation is getting left out when part of the reason it was being changed was due to be lacklustre for tanks.", "author": "Vkona"}
{"url": "/forums/en/wow/topic/20752540783", "title": "Elemental pvp talents?", "replies": "3", "first_post": "I've been closely watching the elemental changes, I noticed a change in the control lava pvp talent that would've made lava burst scary again, but didn't read it in the patch notes. Did I miss it somewhere?", "author": "Thundyr"}
{"url": "/forums/en/wow/topic/20752539941", "title": "Enhance Bracers RIP", "replies": "23", "first_post": "blizz FYI after ur bogus \"fix's\" to hailstorm its now so devalued that its not worth taking even with the damage increase to LL from the bracers. is this as u intended to offer legendaries that offer no damage increase, but just adding another spell to the rotation? this also creates a problem with our ring as FB is our only source of frost damage and w/o HS its not worth casting.... hmmmmm at what point in ur testing did you not see this becoming a problem? could we get some feedback on this topic?", "author": "Nickoa"}
{"url": "/forums/en/wow/topic/20752500761", "title": "Guldan/s2m Possibilities", "replies": "2", "first_post": "The 1st Phase of Gul'dan fight on PTR gives extra action button to everyone depending on their role. DPS gets a +30% haste I believe? For 30 seconds as long as you dont take damage. The top %dps are spriests although most% of spriests do mid tier dps. Be interesting to see how high the best spriests dps gets when they activate that buff with s2m Big richard dps! Im not sure any of this is right but yea comments?", "author": "Hughmyron"}
{"url": "/forums/en/wow/topic/20752660011", "title": "7.1.5 Class Disasters", "replies": "29", "first_post": "So as most people do, I dislike the class I have played for so long because of the changes blizz has made to every class. So with this next patch I wanted to reroll. However, everywhere I go I see current 7.1 problems with every spec. Now, after reading the posts on the 7.1.5 forum, I'm left wondering... what do I do now? I haven't seen a single positive post, and I'm unsure of which class/spec is worth investing the time into. Am I just reading to far into the negative things, and not seeing the positives, or is every single class really that bad?", "author": "Varrox"}
{"url": "/forums/en/wow/topic/20752519629", "title": "Stat Rebalancing Sucks.", "replies": "1", "first_post": "Hi there! i've been an avid forum poster during this ptr, and sadly, i've not found much to be happy about! Apologies, but this continues here. The Changes to secondary stats, with the intent to bring them more in line, has done nothing of the sort for the demon hunter class, and i'm sure there are others (Please Discuss) because of the changes, my stat priority has changed drastically. Crit>Vers>Haste>Mastery Is my live build Mastery>Crit>Haste>Vers is the PTR Demon hunter build. So Basically, because of changes made to mastery and versatillity, they have changed drastically. This is a problem. Going in to the nighthold, and all of the gear that i have worked hard on earning, is now subpar, and close to useless, because of attempts to balance stats. Because of my Live Priority, i have next to 0 mastery on my gear, as i'm meant to. But tomorrow, that next to 0 mastery is going to be Hell on high water for a DH. I've earned gear up to 883 Itemlevel currently, and it feels like it's all going to be useless tomorrow. I feel gutted and unhappy. Is there anybody else feeling the same? IS IT TIME TO THINK ABOUT RE-INTRODUCING REFORGING?", "author": "Boomerang"}
{"url": "/forums/en/wow/topic/20752439978", "title": "Unforgivably Old/Bad/Tacky Ability assets", "replies": "11", "first_post": "That spell or model that you see all the time and wonder \"WTF is blizzard thinking?\" From time to time Blizz goes back and reworks old model assets, they say, to increase the overall level of visual fidelity. But sometimes they continue to use the old crappy ones over better alternatives. Much of the time, even toys or the abilities of unimportant NPCs such as rare mobs, look better than what our characters have. Sometimes they will make graphics that look really nice and then never even use them, like the old hunter volley. So what are these crappy graphics that you see and think \"wow what an eyesore\" For me, its Holy Fire (also used on paladin glyphs). Looks like it was taken from the Everquest era. Also, Power Word: Shield. This same 2D shield is used for everything. It was kinda cool back in vanilla, but if you look overhead on your character you can see how flimsy and terrible this graphic is. And they use it for EVERYTHING even demon hunters soul barrier and legendary item effects despite having many better shield graphics like divine aegis in the game. WTF blizzard. Also worth mention IMO: Avenging Wrath is super tacky, could use an update. What about Tyrael style wings? Lightning Bolt for ele sham looks awful. Doesn't even really look like lightning. Sad because I think this graphic is relatively new.", "author": "Sylpheed"}
{"url": "/forums/en/wow/topic/20752268616", "title": "PROT WARRIOR - DEVASTATOR", "replies": "50", "first_post": "This talent should not be in the same tier as indomitable. 1. Currently Prot feels very gimped without Devastator for DPS and Iindomitable for survivabilty. Why do prot warriors have to give up DPS for survivabilty? while all other tanks are doing more dps than prot warriors? Please change the tier in which these two talents are currently placed. 2. Focused Rage vs Revenge, Vengeance Talent now functions with revenge instead of Focused Rage, but FR was off the GCD but revenge is, please make the Vengeance-revenge off the GCD. It will make the rotation feel more fluid, esp when you don't take devastator (which you most likely won't for progression in current tier). Not only does this gimp our survivability because now we have to wait for a GCD to get an IP out due to revenge being on GCD but it also slows down the general game play a lot. This is a huge survivablity nerf. EDIT: Sco's video https://www.youtube.com/watch?v=CMy85TqwcJg", "author": "Aggronought"}
{"url": "/forums/en/wow/topic/20752550032", "title": "Patch live on 10th, With Glaring Issues.", "replies": "31", "first_post": "http://blue.mmo-champion.com/topic/791360-patch-715-arrives-on-january-10/ This patch is going live on the 10th. Feels like the straw that breaks the camels back. Stats are completely changing for me, going from crit>vers>haste>mast to Mastery>crit>haste>vers Legendaries across the board are nerfed Bad Legendaries are still bad (Nerf was obviously pointless) Classes across the board gimped (Hunters, Warlocks, Etc There is literally NOTHING i am looking forward too about this patch. infact, i hate the idea that the developers can make such horrible, radical changes, filled with nerfs, and we have to cop it on the chin, after promising not to do so. Please take another look at the patch before you launch it. Delay Nighthold, Fix The Problems With The Patch, Or Loose Subscribers Over it. Please discuss.", "author": "Boomerang"}
{"url": "/forums/en/wow/topic/20752507865", "title": "Do not let 7.1.5 go live", "replies": "48", "first_post": "Blizzard, i just got the background download for 7.1.5... I know there is more changes to come... but please... Currently a LOT of classes are not happy with the changes you have made, plus there is a massive amount of GOOD feedback on this and many other forums. Please don't let it hit live in this state, many many changes still need to happen. EDIT: looks like we are too late friends, 7.1.5 arrives tommorow, good luck everyone", "author": "Bjoramier"}
{"url": "/forums/en/wow/topic/20752507967", "title": "Disc PVP Changes", "replies": "2", "first_post": "While I posted most of this on the Arena forums (getting lost with thread spams of PVP title handouts, I guess I time things poorly), I'd like to put my input on the PTR forums for more perhaps more and better feedback before things go live. In general, Disc healing in PVP is weak. In 2s however, Disc is strong because of its ability to take more advantage of doing damage/healing with atonement because of less damage output in the bracket. Basically the more enemies/damage there is going out, the worse Disc gets. For a list of things on live servers, basic Priest problems in PVP include: lowest mobility of all the healers, weak healing output (mostly in AOE, PTR changes helping a lot with this), weaker cc (only healer with only 1 cc DRing tree, though perhaps not really a bad thing for the game), and weak dispel protection (not sure best way for fixing this or if it should just be ignored balanced around it). I would like to begin by going over each talent row and my opinion on what/how to fix them. Basic Talents: Row 1: Penitent should be baseline, have Purge the Wicked replace its spot and do some #s tuning on this row with it. Row 2: Mostly fine, however feather and body and soul feel weak in PVP as priest has the worst mobility of all the healers. Masochism on PTR with 10% damage reduction included feels fine. With the other changes I’ll be listing, changing this row too much could be over the top. Row 3: In general, I think Psychic scream should just be a baseline 30 sec cd. Shining Force is a niche talent but I think its fine on this tier already (45 sec cd on PTR vs 1 min on live). With 30 sec CD scream, change Psychic Voice to be a ranged targetable scream with a cast time and an added 15 sec cd (this could possibly be too strong however). As Dominant Mind currently does nothing in PVP, my idea for changing it would be it to have a 2 min cd still, but have it cause a target to have reverse targeting (can’t attack enemies, can only attack allies) for 5 seconds. Row 4: Shield Discipline is still worthless in PVP but overall this talent row can stay as its mostly PVE based/balanced. Row 5: Another mostly PVE impacting row. Twist of Fate with Defender of the Weak is mostly my personal preference for talent combination anymore because of the weak healing output in PVP, but with some numbers tuning, I could see Power Infusion getting more usage again. Contrition still mostly worthless in PVE and PVP imo. Row 6: Divine star is pointless in PVP as the output is almost not worth the global to use it, but overall the row can stay the same. Row 7: Grace is too mandatory. Without it, healing is terrible in both PVP and PVE (I know Purge is used a bit in raiding). It’d be nice to get Grace baseline (Purge the Wicked moved to r1 as mentioned before) and have 2 other talents replace this row so it doesn’t feel too cookie cutter. I don’t really know what to replace them with though, perhaps something to boost atonement healing passively and something else? PVP talents: Row 1: The PVP trinket row is overall fine and perhaps needs no changes. If anything, my personal opinion is to put Relentless back to 25% and disable racial abilities in rated PVP (Allow them in Random BGs/WPVP though, more on this below in general changes) Row 2: I’d like Inner Renewal to be removed as it’s taken mostly for 2s, and when it’s taken, it just drags games out. I don’t know of a good replacement talent for it though. Row 3: I’m fine with this row of talents, though Spiritual Cleansing is a bit RNGish and niche usage. Row 4: I think the redesign of this row on the PTR is about perfect. The new talent Trinity (20% atonement boost, atonement added via plea and lasts 15 seconds longer) is nice vs non-mage/hunter/shaman teams. Searing Light can still be used for 2s. I sort of feel Premonition should be off the GCD due to how GCD locked Disc playstyle is, but unsure if it should happen. Row 5: I like the redesign here as well, though Ultimate Radiance (Power Word: Radiance gets a CD but becomes instant with a large heal output) with combined Trinity may cause it to outshine the other talents in the row due to the large massive and instant AOE healing (This may need to be nerfed with a longer CD). I’d like to see Dome of Light maybe reduce Pain Suppression CD and/or reduce the damage reduction as well. 4 min CD Pain Suppression baseline is terrible and makes it one of the worst defensive CDs in the game imo. Row 6: Power Word: Fortitude needs to be undispellable. Bake in something like a passive 5% healing increase to targets affected by it and it should be good to go. This would allow it to compete with Archangel and Dark Archangel. Dark archangel is pretty niche of a talent so I’d be hesitant to change it too much with a constantly changing meta. Any constructive feedback on all this would be great and I'll update it as needed.", "author": "Dart"}
{"url": "/forums/en/wow/topic/20752599256", "title": "Question on Artifact Research Notes", "replies": "2", "first_post": "My sister just started playing not too long ago and she's on her 5th artifact research. Since you can buy the 15th research on Tuesday, should she use the research notes she gets or keep them until she can buy the 15th, and then use it in order to get to the 16-17th?", "author": "Resort"}
{"url": "/forums/en/wow/topic/20752618134", "title": "Ion DK UH Feedback (Part Two)", "replies": "71", "first_post": "The initial thread has reached its post limit. Taking the initiative and making the second part to it here. Original thread: https://us.battle.net/forums/en/wow/topic/20752535075?page=1 Friendly reminder to all fellow members of the DK Community to remain civil as you continue to provide constructive feedback about the state of the spec. Keep it restricted to Unholy discussion only, please (things encompassing all three specs are fine too, but this is still an Unholy-centric thread first and foremost). Here's Kaladk's original post (formatting might be off; can't quote it exactly from the forums since the thread is capped): ...", "author": "Dreadfury"}
{"url": "/forums/en/wow/topic/20752610180", "title": "Great job Blizz keep up the bad work", "replies": "88", "first_post": "Just want to motivate Blizzard on a job poorly done, keep at it brother.", "author": "Andarick"}
{"url": "/forums/en/wow/topic/20752550226", "title": "Who buys the Artifact Knowledge catch up?", "replies": "28", "first_post": "Could you guys tell me who buys the artifact knowledge catch up scroll? Is it only the main character with the highest AK, or can my alt character I actually play buy the scroll using the alt's resources? It may be lazy, but rather not farm 10k resources on a character I don't plan on playing at all (which happens to be the AK25). Thanks a lot.", "author": "Jonn"}
{"url": "/forums/en/wow/topic/20752580080", "title": "STOP MAKING LEGENDARIES REQ", "replies": "16", "first_post": "There are so many specs right now that require you to get lucky enough to get a certain legendary to make your spec VIABLE. Classes should play the same with or without legenadaries what if you NEVER get that legendary you never get to play your spec correctly ?!", "author": "Serval"}
{"url": "/forums/en/wow/topic/20752468167", "title": "Rogue snares to 30%, Feint cost to 35", "replies": "13", "first_post": "These nerfs need an explanation. This isn't some % increase or decrease to our template or \"aura\". These changes are massive and will take a huge toll on the playability of the class in PvP and to a lesser extent world PvE and 5 man dungeon utility. These changes are so harsh, the players NEED to know Blizzards reasoning for this. Why are rogue snares being reduced to heavily, but other classes keep 50% snares? Considering how mediocre rogues are right now, not being top dogs in damage output or tankability, or mobility for that matter, this utility and gap closing tool needs to stay at 50% Why was this done? The feint nerf is equally as baffling. Feint is used in conjunction with the talent elusiveness as a rogue's lifeblood to be able to survive for more than a few seconds while being attacked in PvP. Rogues are generally thought of as one of the easiest classes to burst down and kill, and increasing Feints energy cost so drastically will really just make us unable to enter a melee fight altogether. If the talent was considered too good, why not buff the other talents in the row? Or if this change was due to the legendary feint healing pants, why would you nerf the base ability and not THE PANTS? These two changes will cripple an already struggling class in PVP, we NEED explanation.", "author": "Antarris"}
{"url": "/forums/en/wow/topic/20752348926", "title": "Feral Druid Feedback", "replies": "17", "first_post": "First off, I just want to say hats off to the devs, you guys are working really hard and making a lot of really good changes. However, the one thing that irks me the most, is the change to Omen of Clarity. While I see the idea you are going for, I don't think it's as productive to just go straight for those 3 abilities. Rotation wise, Omen is just a way of speeding up the class playstyle, which is needed because Feral plays so slowly. On the PTR, when I get a proc for omen but I don't have enough energy pooled to rake, I have to wait for the energy to pool back for rake so I can then Rip on the same Blood Talons proc. Overall makes it a lot more clunky to use, in my experience. Suggested Changes: Omen of Clarity causes your next *non-finisher ability* to be free of cost. Being able to utilize things like Moonfire and Rake as part of my Blood Talons rotation without energy pooling as hard will make it a lot easier on me - while at the same time not wasting the proc on a 25 energy bite or a 30 energy rip. Edit: Make Savage Roar baseline, then put MoC on par with Incarn and Soul of the Forest. We would just have to give them brainfood for a talent to replace MoC in that same tier. Maybe bring back Lacerate and put it on par with the other two talents? \"Deals [1+61.6% of AP] Bleed Damage and an additional [25.6% of AP] over 15 seconds. Stacks up to 3 times.\" - Copying from the MoP abilities, just adjust the math to make it scale off of our Mastery for the DoT and allow us to stack another bleed? Make it generate 1 CP rather than reset the CD on Maul, and just give us something else to play with in the Blood Talons tier. I would take Lacerate over Blood Talons, especially if it had comparable damage output with the ramp up.", "author": "Serrow"}
{"url": "/forums/en/wow/topic/20752398729", "title": "Feral OoC change", "replies": "11", "first_post": "There have been numerous threads already made on this subject, but I'd like to address it again and hopefully see a blue post directed at Feral players, if at all possible. Why was Omen of Clarity changed in the first place and could we possibly see this change reverted? At the moment, it works very well to quicken your rotation when energy starved. With the change on the PTR, only being able to use it on Shreds in single target means that any skill OTHER than that will have to wait. Savage Roar (40 energy), Shred (40 energy), Rake (35 energy), Rip (30 energy), and even Ferocious Bite (25+25 additional energy) all benefited from OoC procs because it would quicken your rotation. It gave you the opportunity to burn a spender at 5CP when you were energy starved from building CP, or it allowed you to use that quick Rake to keep the uptime high, as examples. Being stuck with only Shred using OoC procs makes an already complicated rotation even more clunky, as you'll never be able to jump forward in every situation like you can now. Having our energy-saving passive relegated solely to Shred, Thrash, and Swipe does not seem conducive to our rotation and feels like an indirect nerf to our single target damage.", "author": "Nectarines"}
{"url": "/forums/en/wow/topic/20752589942", "title": "Questions from a new player", "replies": "1", "first_post": "Posted in wrong section please delete", "author": "Thaztur"}
{"url": "/forums/en/wow/topic/20752588908", "title": "WPvP in 7.1.5", "replies": "15", "first_post": "Is the world defense ping system going to be fixed? WPvP has kept me subbed. WPvP is damn near dead, and i'm close to hitting that unsub button. PvP is also garbage....", "author": "Burrberry"}
{"url": "/forums/en/wow/topic/20752429899", "title": "7000 development hours for this", "replies": "4", "first_post": "Assuming a team of 20 developers for this patch did blizz and by proxy it's customers get their moneys worth for this patch? I'm going to say no.", "author": "Darakuko"}
{"url": "/forums/en/wow/topic/20752570434", "title": "Mages will be top DPS in Nighthold", "replies": "2", "first_post": "If they are not top DPS when the patch goes live, rest assured that they will be hotfix buffed by at least 10% before Nighthold release. And/or anyone beating them will be nerfed.", "author": "Ikhj"}
{"url": "/forums/en/wow/topic/20752500701", "title": "Havoc DH Demonic Build: Fury generation issue", "replies": "3", "first_post": "First of all, let me say that I am fully aware of the patch launching tomorrow but I figured that I should bring this to the dev's attention anyway. In it's current state on the PTR the Demonic build heavily relies on Demon's Bite's RNG to generate fury in order for us to keep pumping out Chaos Strikes and Eyebeams. This is a serious issue especially when we don't have a form of passive fury generation outside of Demonic Appetite to fuel our rotation. If DA doesn't proc we are sent scrambling to gather as much fury as we can for our next spender. To me, this is not satisfying gameplay. I like the concept of the Demonic build and I REALLY want to enjoy it but I can't when i'm put into an RNG stranglehold. So I have to ask; are there any plans to remedy this in the future?", "author": "Eradros"}
{"url": "/forums/en/wow/topic/20752366282", "title": "Q&A MM Hunters - Potential Fix", "replies": "4", "first_post": "This post is meant to clarify the misunderstanding between players and blizzard about what’s happening to MM hunters, while also trying to fix rotation and dps performance. I’m not talking about tuning, just trying to get things straight. What players want; What Blizzard wants; What’s happening now and possible solutions. Blue posts and players are also welcome to clarify any misleading information. CLARIFICATION Q: What’s wrong with MM? Why is Blizzard changing it? R: Vulnerable debuff too strong for aoe, but not that competitive ST. Q: Why are the PTR changes so bad [BUILD 23038]? R: Because the currently changes guts aoe to a not satisfactory level, while not adressing the ST problems. In other words a nerf to our overall dps on live. Let’s not forget the gameplay design is terrible (RNG dependant). Q: What’s THAT problem everyone is talking about? Is only about DPS loss? R: While the actual sidewinders/patient sniper rotation are mandatory for a top dps performance, some players didn’t like it’s gameplay (nor the baseline one). Also choosing SW/PS is like cheating the vulnerable mechanic, because you force it’s activation to gain it’s full benefit regardless of the fight situation (AOE and ST). Forcing a vulnerable debuffs TO ALL TARGETS and increasing damage taken by 150% doesn’t feels right for Blizzard. Q: So, in other words, Blizzard failed on MM's rotation and tuning (design)? R: Technically and philosophically yes, Blizzard failed. What I can see is: 1 – Blizzard tried to give baseline MM hunters a Colossus Smash rotation with Titanic Might (a version that no sane arms warriors would pick), but \"fixed\" with SW/PS talents that works like a Colossus Smash that’s baseline for arms, with a significant burst for AOE, and no downsides. In short, people HATE this kind of rotation (big damage increase tied on a target), because outside of the debuff window, your dps sucks, and for aoe, is even worse. It’s just a nightmare to balance this. 2 – On Live’s rotation the talents choice is gone, because vulnerable debuff on demand is better than rng. Every sane dps player like to have CONTROL of it’s character gameplay. Instead of giving players CONTROL baseline, Blizzard is giving CONTROL via 2 talents (SW/PS), if they nerf one of them, you’re a dead spec (What's happening now). Q: What about the spec gameplay flavour? What’s a potential fix? R: People don’t like RNG, if you want a proc, it’s preferable to be on a talent. Having CONTROL on your burst is crucial, it’s one of the things that differs bad and good players. One thing to note is that, unfortunately the vulnerable mechanic (or colossus issue) has to stay, because it’s not a patch to redesign na entirelly spec, but to modify the actual rotation. So we have to do something with this vulnerable debuff. That said, the main thing to do is to remove the rng on Hunter's Mark proc, and add some variation to a talent. ROTATION REBALANCE So initially I think the best way to solve this is a building up mechanic, the Hunter hits the target with it’s shots, targets get vulnerable, next shot becomes powerful. So, the new rotation will be: Arcane Shot (ST) and Multi-shot (AOE) applies Hunter’s Mark for a 100% chance. Hunter’s Mark enables Marked Shot. Marked Shot consumes Hunter’s Mark and aplies Vulnerable. Vulnerable increases the damage of your next Aimed Shot and Multi-shot by 100%, Vulnerable is CONSUMED IN THE PROCESS. Make Vulnerable tuning for AOE and ST RIGHT HERE, DON'T MESS WITH IT ANYMORE. Marked Shot will generate focus, Arcane Shot and Multi-shot are only ACTIVATORS FOR FOCUS REGENERATION and damage debuff AKA Marked Shot. In short: [ST] Arcane Shot > Marked Shot > Aimed Shot > REPEAT ; [AOE] Multi-shot > Marked Shot > Multi-Shot > REPEAT Pretty simple, no RNG, balance numbers and focus, with a little build up. Rotation fixed. Now let’s spice it up with talents and artifact. Windburst: Stays the same, but aplies Vulnerable right of the bat. Use it on CD. Rotation: [ST] Windburst > Aimed Shot > Arcane Shot > Marked Shot > Aimed Shot > REPEAT ; [AOE] Multi-shot > Marked Shot > Multi-Shot > REPEAT", "author": "Dimmuaim"}
{"url": "/forums/en/wow/topic/20752500654", "title": "How Can You Let It Get This Bad", "replies": "36", "first_post": "How is it possible that blizzard has allowed the relationship between themselves and the player base decay to the all time low it is at? I mean any business that relies on consumers knows how vitally important to work with them to stay successful. Even after admitting communication has been bad, it only got worse. The lies, the deceiving, the shear lack of passion is overwhelming. They will say they have passion, I know they will, I have seen them say it, Yet not one of them will venture forth to show us. Just how far out of touch they are with us shows volumes. They believe the one liners they continue to give us is an acceptable practice. I don't think there is much hope left for this crew, If it stays the way it is, they will become the true wow killer themselves. Its already started, and will take a massive change to start regaining what they used to have with us back. You guys should be ashamed and embarrassed at how you treat your consumers. Its scary to know these are the people in charge going forward. signed: One extremely pissed hunter", "author": "Easybreezy"}
{"url": "/forums/en/wow/topic/20752606511", "title": "Feral question for the Devs", "replies": "5", "first_post": "I know we are not supposed to do this, but at this point it has to be done. After all of the negative feedback with LOTS of reasons give why against the OoC change, it seems you have started doing a balance pass. Simple question, does this mean no mechanical changes will be done like taking back that horrible change? Does this also mean the promise of baking in the talents that are taken at near 100% are also not going to have anything done to them and SR/JW/BT is going to be mandatory still? Because, as has been shown in all of the feedback done, your buffs will do nothing and with the OoC change, the MoC change is still a dps loss. So will more mechanical changes be made and the seeming balance pass is not a sign of feral feedback being ignored again?", "author": "Tenshirou"}
{"url": "/forums/en/wow/topic/20752500601", "title": "7.1.5 Patch Notes?", "replies": "7", "first_post": "Maybe i've been living under a rock but has anyone seen a list of the complete patch notes yet? With the Patch being 2 days away this seems like BS that they haven't released them yet.", "author": "Snowstrider"}
{"url": "/forums/en/wow/topic/20752529349", "title": "Patch notes are live", "replies": "17", "first_post": "https://worldofwarcraft.com/en-us/news/20457825/patch-notes-world-of-warcraft-patch-7-1-5", "author": "Homeademayo"}
{"url": "/forums/en/wow/topic/20752580351", "title": "This patch is the eagles for demon hunters.", "replies": "8", "first_post": "Man. I am SUPER HYPED for this patch :). I really love dem DH changes makes me very happy. With no real desire to make an alt i was sort of stuck on DH for the time being and this patch is kinda like Gandalf showing up at helms deep. \"You stood fast, and now is your time to be rewarded\" Anyway all of the other stuff in the path looks pretty cool, especially the buff to my !@#$ty legendary, xavaric's. Still don't find it super useful as I'm dps...... but it might make me wanna tank again. And that Kirin tor tavern crawl event looks pretty silly :P. What are your guy's favorite stuff about the patch? (Or the stuff that you think is bull)", "author": "Glavies"}
{"url": "/forums/en/wow/topic/20752429621", "title": "[7.1.5] Set Sail!", "replies": "54", "first_post": "WOOOHOOOOOO WHO else is stoked for this patch to drop on Tuesday? I am! Hop on! I'm on a boat! | | | )_) )_) )_) )___))___))___)\\ )____)____)_____)\\\\ _____|____|____|____\\\\\\__ ---------\\ /--------- ^^^^^ ^^^^^^^^^^^^^^^^^^^^^ ^^^^ ^^^^ ^^^ ^^ ^^^^ ^^^ IT'S TIME TO SET SAIL FOR FAIL! LET'S ALL GET READY FOR THIS TRAVESTY TOGETHER! /sarcasm off Troll if you want, I just thought everyone else who was upset with the most recent changes would enjoy a place to let loose, you know, without having to navigate a sea of tears or whining. Who wants a boarding pass!?", "author": "Felominashal"}
{"url": "/forums/en/wow/topic/20752440242", "title": "Mana break OP AF", "replies": "1", "first_post": "deals up to 70% of players hp ?!?!?! GG", "author": "Serval"}
{"url": "/forums/en/wow/topic/20752519426", "title": "New Design Models for Blizzard", "replies": "5", "first_post": "I know that designing is difficult and that its even more challenging for devs to figure out exactly what customers want. Because of the way that item and artifact progression are in this expansion it's more important than ever before that EVERY SINGLE spec is enjoyable to play for the types of players that play those specs and that the numbers balance is decent. I want to propose some new methods that Blizzard can use to gather metrics and decide what to work on. Community Voting Devs gather up a list of their ideas and some highly voted community ideas, send out mail to every player of that class regardless of level with a link asking which talents, spells, etc seem the most interesting. Make sure to tell us what the rotation looks like so we can have an idea of what sort of encounters you imagine for us and our role in them. Next do the same thing but for what we dislike about the class/spell/spec. Once you have that have a data analyst (intern who can use excel) put this in a spreadsheet and then make another post for the community to review about your plans. Give it a week or two, let some discussion build. Then take a minute and make something great, do 10/10 work. Make the game so good that some poor kid has to drop out of college, I believe in you. I believe in the Blizzard devs! Community Manager for Each Spec Imagine a world where Affliction Warlock has a community manager, Ret Paladin has one, everyone else has one; the only requirements? This person is literate and has played that class for a minimum of 3 expansions in the history of Warcraft, better yet give every spec 2 community managers that fight for that spec and represent the players. Have someone who is personally invested in every single spec so that every single class can feel fun and interesting maybe even *feel* overpowered without actually being overpowered. Careful Balancing I'm sure that you guys know how much damage you expect a class to be doing. So instead of completely overbuffing and gutting specs how about you just love tap everything until its where you want it. Shadow Priest doing 400k damage when you want people doing 300k but its fun to play. Then don't change anything but numbers. Take their top 3 damaging abilities and nerf them by the percentage it takes to get them to 300k. Ret Paladin doing 270k when you expect them to do 300k, buff the underused talents a little bit so they have some more choices, buff their weakest attacks by 20% so they are doing the amount you want them to. Talk with us not at us A lot of the people who play your game have been with you guys for a decade or longer. They* should be treated like family. They shouldn't be talked at, they should be communicated with. If you try and homogenize every class/spec and take away all the flavor then no one is going to love your game. Its much more important that people love a class than that no one hates a class. I play Affliction Warlock, people don't enjoy it the way I do, many people prefer to see large crits and have huge awesome plate armor or be a mage with fireballs and whatever. I like being an evil little gnome that bleeds his enemies to death slowly while striking extremely ironic fear into them. But I love the class. I love my race, I love my spec. And my spec deserves someone who will fight for it, so does everyone else. Please Blizzard help us to trust you guys again. Do you guys know how badly we want to have you guys do it right so we can just drizzle non stop praise on you until the next expansion? We aren't on the forums to complain, we are on the forums so that you guys can improve what you are doing so that we can give you guys the respect you deserve. You guys are some of the best devs in the world. Act like it. *I say they and not we because I haven't invested that kind of time yet", "author": "Binxy"}
{"url": "/forums/en/wow/topic/20752655740", "title": "Class design legions downfall", "replies": "63", "first_post": "I think every one can agree legion has been amazing when it comes to the content,art,music and story. But the one thing I see thousands and thousands of posts about is how much everyone hates playing their once loved class this is a big problem to me no matter how great the world and content is if you hate the class your adventuring it with why even bother? I don't understand why the devs won't just give the people what they want and make the classes fun again not keep taking and taking until there's nothing left", "author": "Serval"}
{"url": "/forums/en/wow/topic/20752570247", "title": "Blues on perm vacay", "replies": "5", "first_post": "Is it just me or has this ptr run been handled the worse in the history of ptrs I have never in my life seen the forums so active and the player base so unified all agreeing on the Same issues but yet we can barely get a response and instead of the fixing issues they need too they keep trying to do band aid fixes for example the new MM Build is AWFUL the rotation is so clunky we have a marked shot that costs the same amount of focus as our aim shot but does way less dmg so who would ever use it our 4 piece bonus got nerfed so bad that it actually sims out more benificial to use other items with better stats whats left to look forward too ? I had such high hopes for this patch after blizz con but seriously all that you managed to do is make my experience with this game worse to the point when I log on Tuesday and try to play my new spec I'll decide if I'm going to UN SUB WHERES THE COMMUNICATION???", "author": "Serval"}
{"url": "/forums/en/wow/topic/20752510808", "title": "Are Taurens the best race for Spriest?", "replies": "11", "first_post": "Are Tauren Spriests the way to go for 7.1.5? A couple people in trade today said Tauren is the race to go for. I haven't played a caster class in a long time and really want to make one, so I'm thinking spriest but can't decide on the race. Just going to do casual raiding so looking for suggestions/reasons what class the community feels is fun and best for the group. Thanks everyone!", "author": "Crazyfur"}
{"url": "/forums/en/wow/topic/20752165035", "title": "Master Thread: @Demon Hunters", "replies": "296", "first_post": "Post all DH Related Things Here", "author": "Vailoran"}
